/*
 * Copyright (c) 12.2016
 */

package com.mikhail.mj82.Converter;

/**
 * Класс содержит все типы объектов на карте OSM, которым присваивается свой номер (код)
 * для записи его в файл карты.
 * 
 * @author Mikhail Kushnerov (mj82)
 */

import java.util.HashMap;

/* Запись в файл карты - Тип объекта - Описание объекта
 * N - ТОЧКА
 * W - ЛИНИЯ
 * Wp - ПОЛИГОН
 * R - ОТНОШЕНИЕ
  
 0 = объект отсутствует
  
                              ДОРОГА (highway) [1 - 99]
  
 1 = motorway     Автомагистрали — автомобильные дороги, имеющие многополосную проезжую часть 
                  с центральной разделительной полосой, и не имеющие пересечений в одном уровне 
                  с другими автомобильными и железными дорогами, трамвайными путями, 
                  велосипедными и пешеходными дорожками. W
     motorway_link     Съезды на развязках дорог, на которых действуют те же правила движения, 
                       что и на (motorway). W
     trunk     Важные дороги, не являющиеся автомагистралями. W
     trunk_link     Съезды на развязках дорог с той же важностью в дорожной сети, что и trunk. W        
 2 = primary     Автомобильные дороги регионального значения, соединяющие города и/или областные
                 центры, дороги межрегионального значения, не являющиеся trunk. W
     primary_link     Съезды на развязках дорог с той же важностью в дорожной сети, что и 
                      primary. W     
 3 = secondary     Автомобильные дороги областного значения, соединяющие областные центры с 
                   крупными населёнными пунктами (районными центрами), а также крупные 
                   населённые пункты между собой. W
     secondary_link     Съезды на развязках дорог с той же важностью в дорожной сети, что и 
                        secondary. W     
 4 = tertiary     Более важные автомобильные дороги среди прочих автомобильных дорог местного 
                  значения, например соединяющие районные центры с сёлами, а также несколько 
                  сёл между собой. W 
     tertiary_link     Съезды на развязках дорог с той же важностью в дорожной сети, что и 
                       tertiary. W       
 5 = unclassified     Остальные автомобильные дороги местного значения, образующие 
                      соединительную сеть дорог. W 	        
 6 = residential     Дороги, которые проходят внутри жилых зон, а также используются для 
                     подъезда к ним. В основном используется теми людьми, которые живут на 
                     этой улице или на примыкающей. Обычно имеют название. W
     service     Служебные проезды: внутриквартальные, въездные, парковочные и т.д. WWp
     living_street     Улицы такого же класса как residential, но на них пешеходы 
                       имеют преимущество перед автомобилями. W
     pedestrian     Для обозначения улиц городов (такого же класса как residential), 
                    выделенных для пешеходов. WWp         
 7 = track     Дороги сельскохозяйственного назначения, лесные дороги, не ведущие к жилым или 
               промышленным объектам, неофициальные грунтовки, козьи тропы. W          
 8 = bridleway    Дорожки для верховой езды. W       
 9 = raceway     Гоночная трасса. W          
 10 = road     Линии, возможно, являющиеся дорогами. W         
 11 = footway     Пешеходные дорожки, тротуары. W         
 12 = steps     Лестницы, лестничные пролёты. W         
 13 = path     Тропа (чаще всего, стихийная) использующаяся пешеходами, либо одним или 
               несколькими видами транспорта, кроме четырехколесного (лыжи, снегоход, 
               велосипед). Местами визуально не распознаётся, так как может проходить по любым 
               типам поверхности. W           
 14 = cycleway     Велодорожка, обозначенная соответствующим дорожным знаком. W
 15 = proposed     Планируемая/проектируемая дорога. W
 16 = construction     Строящаяся или ремонтируемая дорога. W 
 17 = bus_stop     Остановка. Автобусная. Обычная. N 
 18 = crossing     Пешеходный переход. N
 19 = elevator     Лифт. N
 20 = give_way     Знак "Уступи дорогу" - означает, что участник дорожного движения не должен 
                   начинать, возобновлять или продолжать движение, осуществлять какой-либо 
                   маневр, если это может вынудить других участников движения, имеющих по 
                   отношению к нему преимущество, изменить направление движения или скорость. N
 21 = mini_roundabout     Круговое движение, маленький круг. N
 22 = passing_place     Расширение узкой дороги дающее возможность для встречного разъезда 
                        машин. N
 23 = rest_area     Площадка (стоянка) для отдыха водителей. Не включает в себя заправку и 
                    прочее техобслуживание автомобиля. NWp
 24 = speed_camera     Стационарная камера замера скорости автомобиля, стоящая на краю дороги 
                       или висящая над дорогой. N
 25 = street_lamp     Уличный фонарь, закрепленный на столбе сбоку от дороги. Включается каждый
                      вечер в определенное время. N
 26 = services     Небольшие станции технического обслуживания автомобилей (СТО), придорожные 
                   кафешки. NWp
 27 = traffic_signals     Светофорное регулирование движения. N
 28 = turning_circle     Место (расширение дороги) для разворота, обычно (но не обязательно) в 
                         конце тупика. N  
 34 = platform     Площадка, платформа. N   
 35 = traffic_calming     Лежачий полицейский. N  
 36 = area     Дорога. Wp
 37 = surface     Дорога с определенного типа поверхностью. WWp.             
 
                              ДОРОГА + БРОД (highway + ford)
                               
 29 = ford     Пересечение дороги с ручьем или речкой, брод. NW
  
                              ДОРОГА + "ЗИМНИК" (highway + ice_road)
                                        
 30 = winter_road     Дорога, проложенная по льду озера, реки и т.д. Ледовая переправа. В 
                      теплое время года не существует в принципе. W
                               
                              ДОРОГА + "ЗИМНИК" (highway + winter_road)
                                        
 30 = winter_road     Ледовые переправы через крупные реки, а также автозимники 
                      проложенные по льду. W
              
 31 = stop     Знак, запрещающий движение без остановки. N
 32 = mergency_access_point     Знак с числом, помогающий определить ваше местоположение для вызова скорой помощи на 
                                дороге. N
 33 = escape     Аварийная полоса на спуске для грузовых автомобилей и других транспортных средств, чтобы 
                 безопасно остановиться после отказа тормозов.  W
                                
                              ПОКРЫТИЕ ДОРОГИ(surface) [100 - 149]
                                         
 100 = paved     Этот тег ставится на линию, вместе тегом (highway), если дорога, 
                 которую он описывает, в основном имеет твёрдое (не сыпучее) покрытие 
                 по всей длине, например покрыта битумом, асфальтом или вымощена 
                 камнем (это общее, грубое описание поверхности). WWp 
 101 = asphalt     Асфальтобетон, обычно называемый асфальтом. WWp
 102 = sett     Брусчатка. Отёсанные камни (гранитные и т.п.) с плоской 
                поверхностью. WWp
 103 = concrete            Бетон. Бетонное покрытие может заливаться прямо на месте или 
       concrete:lanes      выкладываться привозными железобетонными плитами. Иногда дорогу 
       concrete:plates     с таким покрытием называют „бетонка“. WWp                  
 104 = paving_stones     Тротуарная плитка. Гладкие блоки необязательно прямоугольной
                           формы. Их можно сравнить с брусчаткой, но зазоры между 
                           плитками меньше, потому что их поверхность очень ровная. 
                           Обычно изготовлены из бетона. WWp                                         
 105 = cobblestone               Булыжник. Специально уложенные относительно ровными 
       cobblestone:flattened     поверхностями вверх камни. К булыжникам не применяют 
                                   дополнительную обработку.  WWp                                          
 106 = metal     Металл. Иногда применяется для дорожного покрытия на мостах. WWp 
 107 = wood     Дерево. Иногда применяется для дорожного покрытия на мостах. Также 
                обозначает гать — деревянную дорогу из досок через болотистую 
                местность. WWp
 108 = unpaved     Этот тег ставится на линию, вместе тегом (highway), если дорога, 
                   которую он описывает, имеет покрытие сыпучими материалами от 
                   утрамбованной щебёнки до земли или не имеет его вовсе (грунтовая 
                   дорога) (это грубое описание поверхности). WWp
 109 = compacted     Смесь крупной (например гравий) и мелкой (например песок) 
                     составляющих, утрамбованной катком так, что поверхность 
                     приобретает более устойчивую к разрушению структуру, чем просто 
                     разбросанный гравий. WWp
       dirt     Грязь. Грунтовая дорога, которая по разным причинам постоянно 
                влажная, а потому представляет собой вязкую смесь воды и земли или 
                глины. Важно, что под грязью есть твёрдый слой, в отличие от 
                surface=mud, где его нет. WWp
       earth     Вероятно, то же, что и surface=ground. WWp 
       grass     Трава, укатанная транспортными средствами, утоптанная людьми или 
                 животными (имеет тенденцию превращаться в surface=ground при 
                 активном использовании). WWp 
       grass_paver     Редкое мощение отдельными камнями или мощение в виде решётки 
                       из камней, позволяющее прорастать траве между камнями и 
                       вместе с тем не дающее разбивать дорогу колесами транспортных 
                       средств в мокрую погоду. WWp 
       gravel_turf     ??? WWp
       fine_gravel     Многослойное покрытие с основой из камней или гравия и слоем 
                       спрессованного измельчённого булыжника, базальта или кварца 
                       поверх, изобретённое в Римской империи. Удобно для пешего 
                       хода, езды верхом и передвижения на велосипеде. WWp
       gravel     Гравий — мелкие камни размером порядка нескольких сантиметров с 
                  неровной поверхностью. WWp 
       ground     Голая почва, специальное покрытие отсутствует. Есть следы 
                  передвигающихся по ней людей, животных и транспорта. WWp 
       mud     Вероятно, то же, что и surface=ground. Под грязью, в отличие от 
               surface=dirt, нет твёрдого слоя, за который можно зацепиться — это 
               как ил, где автомобиль будет вязнуть всё больше и больше. WWp  
       pebblestone     Галька — мелкие камни (1–10 см), окатанные до ровной 
                       поверхности. WWp 
       sand     Песок. WWp                                       
 110 = salt     Соляные озёра. WWp
 111 = woodchips     Покрытие из древесной стружки или щепы. WWp                   
 112 = tartan     Тартан. Синтетическое всепогодное покрытие, обычно используемое на
                  стадионах и на прочих спортивных дорожках. WWp 
       artificial_turf     Всепогодное покрытие из синтетических волокон, 
                           имитирующее натуральную траву. WWp 
 113 = clay     Глина. Используется на некоторых теннисных кортах и футбольных 
                  площадках. WWp 
 114 = metal_grid     Покрытие из металлической сетки; часто используются на мостах
                      и лестницах в индустриальном стиле. WWp  
 115 = ice     Дороги, специально проложенные по льду в период замерзания озёр и рек. WWp
       snow     Зимники. WWp  
 116 = decoturf     DecoTurf — искусственное покрытие на некоторых теннисных кортах. Wp 
 117 = paving_stones:30     Тротуарная плитка размером 30 см. WWp      
 118 = paving_stones:20     Тротуарная плитка размером 20 см. WWp 
 119 = granite     Гранит. WWp                                                                                                                                                                                                                
   
                              ПОКРЫТИЕ ПРОСЕЛОЧНЫХ ДОРОГ (tracktype) [150 - 199]
                              
 150 = grade1     Асфальтовое покрытие, мощение плитами, камнем, кирпичом и т. п., 
                  либо хорошо укатанный гравий, кирпичный лом. W  
 151 = grade2     Без покрытия, гравий вперемешку с песком, илом или глиной. W  
 152 = grade3     Выровненная смесь грунта, песка, гравия. W
 153 = grade4     Укатанный грунт с примесями твёрдых материалов. W 
 154 = grade5     Неукатанный грунт, песок, трава. W                                              
 
                              БАРЬЕРЫ (barrier) [200 - 299]
  
 200 = cable_barrier     Тросовое ограждение (тросовый барьер). Это боковое или разделительное 
                         дорожное ограждение в виде стальных тросов на слабо закреплённых стойках. W
 201 = city_wall     Городские, замковые стены. В средние века строились вокруг поселения для 
                     отражения вражеских атак. WWp
 202 = ditch     Ров, овраг, траншея, канава, нередко заполненная водой, труднопреодолимая, 
                 особенно на транспорте. WWp
 203 = fence     Забор (плетень, тын, изгородь). Отдельно стоящая конструкция для предотвращения 
                 пересечения некоторой границы. WWp
 204 = guard_rail     Металлическое барьерное ограждение, иногда использующееся в качестве 
                      разделителя полос. Выпуклая сторона справа относительно направления линии. W
 205 = handrail     Поручень, за который можно хвататься рукой для сохранения равновесия или опоры 
                    при ходьбе. W
 206 = hedge     Зелёная изгородь. Линейное насаждение плотной растительности для обозначения 
                 границы. WWp
 207 = kerb     Бордюрный камень (например, между тротуаром и проезжей частью). Может выступать 
                препятствием для транспортных средств и инвалидов. NW
 208 = retaining_wall     Стена, удерживающая склон от сползания или осыпания. WWp
 209 = tank_trap     Противотанковое заграждение, например, противотанковый ёж. NWWp
 210 = wall     Стена. Капитальное строение линейного типа, ограничивающее пересечение определённой 
                границы. Изготавливается обычно из бетона, кирпича, камня. Как правило, полностью 
                непрозрачна. WWp
 211 = block     Большой твёрдый неподвижный блок, который может быть сдвинут только с помощью 
                 тяжелой техники или больших усилий. Обычно это нечто большое и плотное, сделанное
                 и размещённое специально для преграждения пути автомобилям. Иногда это могут быть 
                 глыбы и валуны естественного происхождения. N
 212 = bollard     Оградительный столб, тумба. Используется для ограничения проезда. NW
 213 = border_control     Это контрольная точка в международной границе между двумя странами. 
                          Паспорта или другие формы удостоверения личности будут проверяться. N
 214 = bump_gate     ??? N
 215 = bus_trap     ??? N
 216 = cattle_grid     Лежащая на дороге металлическая решётка, обеспечивающая проезд транспорта, 
                       но делающая невозможным проход животных (преимущественно скота). Иногда 
                       называется «техасскими воротами». N
 217 = chain     Цепь или трос поперёк дороги. Пройти можно всем, проехать – только тому, у кого 
                 есть ключ. N
 218 = cycle_barrier     Ограждение, предотвращающее проезд велосипедов. Обычно представляет собой 
                         металлические перекладины поперёк дороги с проходами для пешеходов. N
 219 = debris     Завал из мусора, преграждающий обычно заброшенную дорогу. На фото продолжение 
                  дороги за завалом не видно, потому что дорога уходит вниз по склону. N
 220 = entrance     Простой проход в стене или заборе, не имеющий каких-либо особенностей, 
                    ограничивающих движение. N
 221 = full-height_turnstile     Турникет-крестовина в полный рост. Выполняет те же функции, что 
                                 и другие турникеты. N
 222 = gate     Ворота. Проезд в стене или заборе, который может открываться и закрываться одной 
                или двумя створками. NW
 223 = hampshire_gate     Так называемые "хэмпширские ворота". Секция проволочного забора, которую 
                          можно временно убирать. N
 224 = height_restrictor     Ограничитель высоты ??? N
 225 = horse_stile     Специальный барьер, который могут преодолевать пешеходы и лошади. 
                       Пересечение его на транспорте, либо лошадью без наездника и прочим домашним 
                       скотом затруднено или невозможно. N
 226 = jersey_barrier     Барьерное ограждение, состоящее из массивных промышленных блоков. Нередко 
                          используется для разделения полос на автострадах. NW
 227 = kent_carriage_gap     Кентский проезд для карет, используется муниципалитетами Великобритании
                             для запрета проезда автотранспорта на дорогах, предназначенных 
                             преимущественно для поездок в конном экипаже. N
 228 = kissing_gate     Ворота особой конструкции, позволяющие легко проходить людям, но 
                        непреодолимые для скота. Не следует использовать для обозначения обычных 
                        ворот и калиток, через которые по каким-либо иным причинам можно пройти 
                        только пешком. N
 229 = lift_gate     Шлагбаум. N
 230 = log     Используйте этот тег, если дорога перекрыта брёвнами. Такое препятствие создаёт 
               затруднения для велосипедистов, но может быть преодолено, если вручную перенести 
               велосипед через брёвна. На таком бревенчатом препятствии обычно удобно присесть и 
               передохнуть. NW
 231 = motocycle_barrier     Конструкции, не позволяющие проехать на мотоцикле. N
 232 = rope     Верёвка. Гибкая преграда из сплетённых или свитых волокон для повышения прочности. 
                В качестве препятствия играет символическую роль и физически не мешает проходу 
                пешеходов. NW
 233 = sally_port     Проём в стене. Проход сквозь толстые стены, обычно имеющий две пары ворот. N
 234 = spikes     Настил из шипов, препятствующий проезду транспорта на шинах. Может быть убираемым.
                  NWWp
 235 = stile     Лаз, порог, дыра. Вид прохода с препятствием, позволяющий проходить сквозь него, 
                 но который нельзя полностью «открыть». N
 236 = sump_buster     Sump buster — это бетонный блок или стальная конструкция, предотвращающая 
                       проезд транспортных средств с шириной колеи или дорожным просветом, 
                       превышающими определённые значения. (Обычно останавливает обычные 
                       автомобили.) N
 237 = swing_gate     Шлагбаум с горизонтально вращаемой стрелой. Сделан обычно из металла, но 
                      существуют также деревянные и иные вариации. Предназначен для ограничения 
                      проезда автомобилей, но обычно легко преодолевается велосипедистами и 
                      пешеходами. N
 238 = toll_booth     Пункт въезда на платную дорогу. N
 239 = turnstile     Турникет, используемый для прохода только одного человека единовременно. N
 240 = yes     Преграда, тип которой неизвестен. W
 241 = wood_fence     Деревянный забор. W
 242 = wicket_gate     Калитка. N
  
                              ЗДАНИЯ (building) [300 - 349]

 300 = apartments     Многоквартирный жилой дом. Иногда есть магазин на первом этаже. Wp
       farm     Здание на ферме предназначенное для жилья. Wp
       hotel     Здание гостиницы. Wp
       house     Индивидуальный жилой дом для проживания одной, реже двух, семей. Это общий тег. Wp
       detached     Частный отдельный жилой дом. Wp
       residential     Общий тег для жилых зданий. Wp
       dormitory     Общежитие. Wp
       terrace     Тип частных зданий построенных в линию вплотную друг к другу. Wp
       houseboat     Лодка, используемая в основном в качестве жилища. Wp
       bungalow     Небольшой одноэтажный летний домик, дача. Wp 
       static_caravan     Передвижной дом, всегда или почти постоянно стоящий на одном месте. Wp
       commercial     Места деловой активности. Используется, если нельзя определить принадлежность 
                      к одному конкретному виду (например что это только офисное здание, или только
                      торговый центр). Wp
       industrial     Промышленное здание. Wp
       retail     Здание, используемое в основном для розничной торговли. Wp
       warehouse     Складские здания. Wp 
       cathedral     Cобор. Wp
       chapel     Часовня. Wp
       church     Храм, собор. Wp
       mosque     Мечеть. Wp
       temple     Древний полуразрушеный храм, строение ??? Wp
       synagogue     Синагога. Wp
       shrine     ??? Wp
       civic     Общий тег, означающий гражданское использование здания: библиотека, публичный 
                 туалет, бассейн и т.д. Wp 
       hospital     Здание, корпус больницы. Wp
       school     Здание школы. Wp
       stadium     Здание стадиона. Wp 
       train_station     Вокзал (здание при железнодорожной станции). Wp 
       transportation     Грузоперевозки. Wp
       university     Здание ВУЗа. Wp
       public     Общественное здание. В западных странах этот термин обозначает государственное 
                  или муниципальное здание, используемое для общественных нужд. Wp
       barn     Сельскохозяйственная постройка используемая для хранения сена, сельскохозяйственных
                орудий. Wp
       bridge     Здание используется в качестве моста. Wp 
       bunker     Бункер, военный объект. Wp
       construction     Используется для строящихся зданий. Wp
       cowshed     Коровник (хлев) — строение для содержания коров, обычно на фермах. Wp
       garage     Отдельностоящий гараж (один полигон отмечает один гараж). Wp
       garages     Гаражи, ГСК и т.п. Wp 
       greenhouse     Теплица. Wp
       hangar     Ангар - это здание, используемое для содержания в нём самолётов, вертолётов и 
                  других летательных аппаратов. Wp  
       roof     Сооружение в виде крыши или навеса (например на АЗС). Wp
       shed     Сарай является простым одноэтажным строением на заднем дворе, в саду или на 
                приусадебном (дачном) участке, которое используются для хранения инвентаря или в 
                качестве мастерской. Wp
       stable     Конюшня. Помещение для содержания лошадей. Wp
       sty     Свинарник. Помещение для содержания свиней, обычно на фермах. Wp
       transformer_tower     Здание с трансформатором ??? Wp
       service     Служебные постройки с работающим оборудованием, не предназначенные для 
                   нахождения внутри людей. Wp  
       kiosk     Небольшое торговое здание. Wp
       ruins     Руины ??? Wp
       yes     Здание Wp
 301 = entrance     Вход в здание. N

                               ЧАСТЬ ЗДАНИЯ (building:part) [350 - 399]
 
 350 = yes     Часть здания. Wp
       
                              ГИДРОГРАФИЯ ПРОТОЧНЫХ ВОД (waterway) [400 - 499]
                              
 400 = river     Река. Русло широких рек (>12 метров). W
 401 = stream     Ручей. Сравнительно малый поток воды по отношению к реке. W
 402 = canal     Канал. Искусственные потоки воды, созданные для судоходства, перенаправления тока 
                 воды или орошения. W
 403 = drain     Дренажный канал. Используются для осушения территорий, отвода сточных вод. W
 404 = ditch     Канава. W
 405 = fairway     Судоходный маршрут в озере или море, отмеченной буйками. W
 406 = dock     Док. NW
       boatyard     Шлюпочная мастерская, сухой док. Места производства, обслуживания лодок, 
                    катеров. NW
 407 = dam     Дамба. Отличаются от плотины тем, что не пропускает воду поверх. WWp
 408 = weir     Плотина, барьер, заграждение построенное через русло, так что вода течёт поверх 
                него. Часто служит для отлова топляка. NW 
 409 = waterfall     Водопад. N
 410 = lock_gate     Шлюзовые ворота. N
 411 = water_point     Место, со свежей, чистой водой. N
 412 = fuel     Место для получения топлива для лодок. NWp
 413 = riverbank     Русло широких рек. Wp 
 414 = wadi     Естественное сухое (временное) русло, заполняющееся водой только в сезон проливных 
                дождей. Тег использовать не рекомендуется. Тег имеет арабскую специфику и неоднозначное 
                определение. W
 415 = drystream     Малые сухие русла и водороины - отрицательные формы эрозионного рельефа, 
                     образованные деятельностью временных водотоков. W
 416 = yes     Водный объект (обобщенное название). NWWP
       
                              РЕЛЬСОВЫЕ ПУТИ (railway) [500 - 599]
 
 500 = construction     Железная дорога в процессе строительства. W
 501 = disused     Часть путей, которые уже не используются, но вся инфраструктура (рельсовое 
                   полотно, светофоры, контактная сеть) осталась. W
 502 = funicular     Фуникулёры. W
 503 = light_rail     Лёгкий пассажирский железнодорожный транспорт. W
 504 = miniature     Миниатюрные железные дороги обычно перевозят пассажиров и могут быть 
                     туристической достопримечательностью сами по себе. W
 505 = monorail     Монорельс. W
 506 = narrow_gauge     Узкоколейка. Железная дорога нестандартной ширины колеи, не относящаяся к 
                        другим видам рельсовых путей, например, метро или трамваю. W
 507 = preserved     Историческая часть ж/д путей. Часто оставлено для туристических аттракционов. W	
 508 = rail     Железнодорожные линии. W
 509 = subway     Линии метро. Транспорт преимущественно подземного типа, использующийся в городах.
                  W
 510 = tram     Трамвайные линии. W
 511 = crossing     Пешеходные переходы через рельсовые пути. N
 512 = level_crossing     Железнодорожные переезды. Обозначаем сам факт пересечения дороги с 
                          рельсами, знаки не обязательны. N
 513 = halt     Остановочные (раздельные) пункты железной дороги. Всё, менее значимое, чем станция,
                например, платформа, полустанок, разъезд. Может не иметь платформы, также возможна 
                остановка по требованию. N
 514 = platform     Платформы, перроны. Служат для посадки и высадки пассажиров, погрузки и 
                    разгрузки лёгких грузов, обслуживания подвижного состава. WWp
 515 = station     Железнодорожные станции, выполняющие только пассажирские операции. Далеко не 
                   каждый пункт на железной дороге является станцией. Глвным признаком станции 
                   является наличие начальника станции. Внешне — станция обычно имеет путевое 
                   развитие, необходимое для приёма, сортировки, отправления составов. Также 
                   станции обычно особо выделены на схемах ж. д. NWp
 516 = subway_entrance     Вход в метро. Нередко сочетается с подземным переходом. N
 517 = tram_stop     Трамвайные остановки. Точки на трамвайных линиях, где возможна посадка и 
                     высадка пассажиров. N
 518 = abandoned     Разобранные железнодорожные пути. Указывает, что отсутствует железнодорожное 
                     полотно, однако недемонтируемые следы (балластная призма, выемки, насыпи 
                     сохранились. W
 519 = buffer_stop     Преграды в конце железнодорожного пути. N
 520 = derail     ??? N
 521 = signal     Любой железнодорожный сигнал, светофор и т.п. N
 522 = switch     Стрелка на дороге. N 
 523 = railway_crossing     ??? N
 524 = turntable     Поворотные платформы. Обычно используются при депо а также позволяют 
                     разворачивать вагоны и локомотивы. NWp
 525 = roundhouse     Веерное депо — полукруглое здание с множеством стойл для сервисного 
                      обслуживания локомотивов. Wp
 526 = traverser     Передвижная платформа для перевода вагонов с одного пути на другой. NWp
 527 = proposed     Планируемая/проектируемая дорога. W

                               ВОЗДУШНЫЙ ТРАНСПОРТ (aeroway) [600 - 699]
                               
 600 = aerodrome     Аэродромы, аэропорты. NWp
 601 = apron     Перроны. Место стоянки воздушного транспорта для посадки и высадки пассажиров, 
                 загрузки и разгрузки, обслуживания. Wp
 602 = gate     Посадочные терминалы. Используется для нумерации. N
 603 = hangar     Ангар представляет собой конструкцию для удержания самолета или космического 
                  корабля. NWp
 604 = helipad     Вертолётные посадочные площадки. NWp
       heliport     Вертолетная площадка. NWp
 605 = navigationaid     Радио-навигационное оборудование (диспетчерская). N
 606 = runway     Взлётно-посадочные полосы. WWp
 607 = taxiway     Рулёжные дорожки. WWp
 608 = terminal     Терминалы, здания аэропорта. NWp
 609 = windsock     Место установки указателя силы ветра. N
 
                               КАНАТНАЯ ДОРОГА (aerialway) [700 - 799]
 
 700 = cable_car     Канатная дорога с большими закрытыми кабинами, рассчитанными на одновременную 
                     перевозку более 8 человек. W
       gondola     Канатная дорога с небольшими кабинами, рассчитанными на 4,6 или 8 человек. W
       chair_lift     Канатная дорога с открытыми креслами. W
       mixed_lift     Подъёмник с кабинами и с открытыми креслами одновременно. W
       drag_lift     Бугельная канатная дорога для горнолыжников. W
       t-bar     T-образный подъёмник. W
       j-bar     J-образный подъёмник. W
       platter     Тарелочный подъёмник. W
       rope_tow     Движущийся канат. W
       magic_carpet     Ленточный подъёмник. W
 701 = zip_line     ??? W
       canopy     ??? W
 702 = pylon     Опора канатной дороги. N
 703 = station     Станции канатных дорог для посадки и высадки пассажиров. NWp
 704 = goods     Грузовой подъёмник. Перевозка пассажиров, как правило, запрещена. N
 
                               ЭНЕРГЕТИКА (power) [800 - 899]

 800 = plant     Место / промышленный объект, где производится энергия (не обязательно только 
                 электрическая). WpR
 801 = cable     Трасса прокладки кабеля, например, местной 0,4 кВ сети между трансформаторной 
                 будкой, распределительными шкафами и местами ввода кабеля, или морского 
                 подводного кабеля. Не путать с несиловыми кабелями, например, оптоволоконными 
                 или телефонными. W
 802 = compensator     Несколько видов силовых устройств, используемых для обеспечения качества 
                       электроэнергии и отказоустойчивость сети. NWp
 803 = converter     Высоковольтной преобразователь преобразует электрическую мощность с высоким 
                     напряжением переменного тока (AC) для высоковольтной линии постоянного тока 
                     (hvdc), или наоборот. NWp
 804 = generator     Электростанции и генераторы. NWp
 805 = heliostat     Зеркало гелиостата. N
 806 = insulator     Конструкция или устройство предотвращающее заземление линии на опоры. NW
 807 = line     Линии электропередачи. W
 808 = minor_line     Воздушные линии электропередачи среднего/низкого напряжения. Эти линии 
                      прокладываются на обыкновенных столбах (деревянных, металлических или 
                      железобетонных) между постройками, но никогда не прокладываются по 
                      металлическим опорам как высоковольтные ЛЭП (для них используем 
                      power=line). W
 809 = pole     Отдельные деревянные или железобетонные столбы для прокладки линий электропередач 
                высокого и среднего напряжения. N
 810 = portal     Опоры ЛЭП представляющие собой "ворота", состоят из двух вертикальных столбов с 
                  соединяющей их перекладиной, к которой подвешиваются линии. NW
 811 = catenary_mast     Опоры контактных линий транспорта работающего от электричества. N
 812 = substation     Электроподстанции преобразования и распределения энергии, трансформаторные 
                      будки, распределительные щиты. NWp
 812 = sub_station     Электроподстанции преобразования и распределения энергии, трансформаторные 
                       будки, распределительные щиты. NWp
 813 = switch     Распредилительное устройство N
       switchgear     Распредилительное устройство NW
 814 = terminal     Точка подключения от воздушных линий электропередачи до зданий или стен. N
 815 = tower     Опоры линии электропередачи, кроме столбов. N
 816 = transformer     Статическое устройство для передачи электрической энергии с помощью 
                       индуктивной связи между обмотками. Большие силовые трансформаторы, как 
                       правило, расположены внутри подстанции. N
 817 = station     Электростанция (обобщенное описание). NWWp
 
                               ИСКУССТВЕННЫЕ СООРУЖЕНИЯ (man_made) [900 - 999]
                               
 900 = adit     Штольня, горизонтальный вход в шахту. NWp
 901 = beacon     Бакены, буи, сигнальные огни для навигации. N
 902 = breakwater     Волнорез. WWp
 903 = bridge     Указывает контур моста и группирует все части этого моста. Wp
 904 = bunker_silo     Силосная яма. Открытая с боков конструкция для хранения силоса (или 
                       чего-нибудь другого). Туда могут заезжать транспортные средства для её 
                       заполнения и опустошения. NWp
 905 = campanile     Отдельно стоящая колокольня, обычно рядом с церковью. WWp
 906 = chimney     Дымовая труба (Промышленные трубы). N
 907 = communications_tower     Огромная башня для передачи радиосигналов. NWp
 908 = crane     Стационарные подъемные краны, например, портовые. NWp
 909 = cutline     Используется для обозначения просек в лесу. W
 910 = clearcut     Вырубка — участок, где все деревья единообразным способом срублены. NWp
 911 = embankment     Земляная насыпь для прокладки дороги, ж/д путей или канала через 
                      низменности или заболоченные места. W
 912 = dyke     Насыпь для защиты территории от наводнения. WWp
 913 = flagpole     Флагшток. N
 914 = gasometer     Газгольдеры — резервуары для хранения газа. WWp
 915 = groyne     Буна. Приспособление для задержания песка, гальки. Предотвращения их переноса 
                  вдоль берега. Для волнореза есть отдельное обозначение man_made=breakwater. WWp
 916 = hot_water_tank     Aккумулирование тепла ??? WWp
 917 = lighthouse     Маяки. N
 918 = mast     Мачта, столб. N
 919 = mineshaft     Ствол шахты. NWp
 920 = monitoring_station     Станция, которая мониторит какие-либо параметры (метео; загрязнение 
                              воздуха; радиация). NWp
 921 = obelisk     Обелиск. NWp
 922 = observatory     Обсерватория. NWp
 923 = petroleum_well     Буровая. Разработана для того, чтобы бурить поверхность земли для поиска 
                          и добычи нефти. N
 924 = pier     Пирсы, волноломы, молы. Нередко используются для развлечений. WWp
 925 = pipeline     Трубопроводы.
 926 = reservoir_covered     Крытые резервуары. NWp
 927 = storage_tank     Резервуар, бак, танк для жидкости или газа. NWp
 928 = surveillance     Камеры наблюдения. NWp
 929 = survey_point     Геодезические пункты, вышки, станции, ориентиры и прочее стационарное 
                        топографическое оборудование. N
 930 = telescope     Телескоп. NWp
 931 = tower     Башни, вышки. NWp
 932 = wastewater_plant     Станции очистки сточных вод. NWp
 933 = watermill     Водяная мельница. NWp
 934 = water_tower     Водонапорная башня. NWp
 935 = water_well     Колодец. NWp
 936 = water_tap     Колонка. Обеспечивает доступ к воде, обычно, оснащается клапаном. Источником 
                     воды является водопроводная сеть. NWp
 937 = water_works     Станции очистки воды и подачи в водопровод. NWp
 938 = windmill     Ветряные мельницы. NWp
 939 = works     Промышленные строения, заводы, фабрики. NWp
 940 = kiln     Печь. N
 941 = offshore_platform
 942 = silo
 943 = street_cabinet
 944 = yes     Искусственные сооружения (обобщенное название). NWWp
 945 = antenna     Антена. N
 946 = slip     Спуск, съезд. N
 947 = address_nameboard     Адресная табличка. N
 
                               МЕСТА ПРОВЕДЕНИЯ ДОСУГА (leisure) [1000 - 1099]

 1000 = adult_gaming_centre     Место с игральными автоматами, такими как видеоигры, симуляторы 
                                автогонок, пинбол, автоматы с призами (типа детских кран-машин) 
                                и т.п. С возрастным ограничением. NWp
        amusement_arcade     Место с игральными автоматами, такими как видеоигры, симуляторы 
                             автогонок, пинбол, автоматы с призами и т.п. Без возрастного 
                             ограничения. NWp
 1001 = beach_resort     Обслуживаемый пляж. NWp
 1002 = bandstand     Эстрада, на которой музыканты могут исполнять музыкальные произведения на 
                      открытом воздухе. NWp
 1003 = bird_hide     Укрытия для наблюдения за животными (преимущественно птицами) с близкого 
                      расстояния. NWp
 1004 = common     Общественные места для прогулок, без специфики. NWp
 1005 = dance     Танцевальные площадки. NWp
 1006 = dog_park     Обозначенное место для выгула и тренировки собак, с ограждением или без. NWp
 1007 = firepit     Постоянное место для разведения костров. NWp
 1008 = fishing     Места для рыбалки. NWp
 1009 = fitness_centre     ??? NWpR
 1010 = garden     Декоративные сады (не путать с сельскохозяйственными). NWp
 1011 = golf_course     Поля для гольфа. NWp
 1012 = hackerspace     Хакерспейс — место, где люди с общими интересами (чаще всего в области 
                        компьютеров, технологий, науки, цифрового искусства) могут встречаться, 
                        общаться или выполнять совместную работу. NWp
 1013 = horse_riding     ??? NWp
 1014 = ice_rink     Катки, ледовые поля для катания на коньках. NWp
 1015 = marina     Пристани для яхт и катеров. NWp
 1016 = miniature_golf     Поля для мини-гольфа. NWp
 1017 = nature_reserve     Заповедники. NWp
 1018 = park     Парки, открытые зелёные площадки для отдыха. NWp
 1019 = picnic_table     Стол для пикника (отдыха). NWp
 1020 = pitch     Спортивная площадка, поле для различных игр: футбол, крикет и т.д. NWp
 1021 = playground     Детские игровые площадки. NWp
 1022 = slipway     Слипы, места для спуска яхт, катеров на воду. NWp
 1023 = sports_centre     Спортивный центр. NWp
 1024 = stadium     Крупные стадионы. NWp
 1025 = summer_camp     Летний лагерь. Воспитательно-оздоровительные учреждения в разных странах, 
                        предназначенные для детей и подростков и организуемые на время школьных 
                        каникул. NWp
 1026 = swimming_area     Место для купания - место у реки, озера или другого водного резервуара,
                          где возможно искупаться. Wp
 1027 = swimming_pool     Плавательный бассейн. NWp
 1028 = track     Дорожки: беговые, велосипедные, конно-спортивные. WWp
 1029 = water_park     Аквапарки. NWp
 1030 = wildlife_hide     Место наблюдения за дикой природой. NWp
 1031 = sauna     Сауна, финская парная баня. NWp
 1032 = recreation_ground     Площадка для отдыха, площадка для игр. NWp
 
                               ИНФРАСТРУКТУРА, БЛАГОУСТРОЙСТВО (amenity) [1100 - 1299]

 1100 = bar     Место торговли спиртными напитками, где, обычно, есть только барная стойка. NWp
 1101 = bbq     Места отдыха, оборудованные мангалами. N
 1102 = biergarten     Пивные на открытом воздухе. Актуально для Германии (и не только). Пивной 
                       сад. NWp
 1103 = cafe     Кафе, кофейня. NWp
 1104 = drinking_water     Источник питьевой воды. N
 1105 = fast_food     Заведение быстрого питания, фастфуд, забегаловка, пиццерия. NWp
 1106 = food_court     Зона с общими столиками для еды и несколькими ресторанными стойками разных 
                       кафе, ресторанный дворик. Обычно располагаются в крупных торговых центрах, 
                       аэропортах и т.п. NWp
 1107 = ice_cream     Магазин или кафе-мороженое. Место, которое продает мороженое и замороженный 
                      йогурт. NWp
 1108 = pub     Бар, закусочная, корчма, таверна, трактир, паб, пивная. Заведение, где 
                предполагается распитие спиртных напитков. NWp
 1109 = restaurant     Рестораны (не путать с ресторанами быстрого питания). NWp
 1110 = college     Колледж, профессиональный лицей, училище. NWp
 1111 = kindergarten     Детские сады. NWp
 1112 = library     Библиотеки. NWp
 1113 = public_bookcase     Уличный общественный книжный шкаф. Можно взять или оставить книгу. NWp
 1114 = school     Школы и школьные площадки. NWp
 1115 = music_school     Музыкальные школы. NWp
 1116 = driving_school     Автошколы. NWp
 1117 = language_school     Школы обучения иностранным языкам. NWp
 1118 = university      Институты, университеты, кампусы. NWp
 1119 = bicycle_parking     Парковка для велосипедов. NWp
 1120 = bicycle_repair_station     Стойка для самостоятельного ремонта велосипеда. NWp
 1121 = bicycle_rental     Аренда велосипедов. NWp
 1122 = boat_sharing     Аренда лодок. NWp
 1123 = bus_station     Автостанции, автовокзалы. NWp
 1124 = car_rental     Аренда автомобилей. NWp
 1125 = car_wash     Автомойка. NWp
 1126 = charging_station     Место зарядки электромобилей. N
 1127 = ferry_terminal     Паромные причалы: места, где можно погрузиться на борт парома или 
                           покинуть его. NWp
 1128 = fuel     АЗС, АГЗС и прочие. NWp
 1129 = grit_bin     Ящики с аварийным запасом противогололёдных материалов: песком, гравием, 
                     солью. N
 1130 = motorcycle_parking     Парковки для мотоциклов. NWp
 1131 = parking     Стоянки. NWp
 1132 = parking_entrance     Въезд на подземную или многоуровневую стоянку. N
 1133 = parking_space     Одиночные парковочные места. NWp
 1134 = taxi     Стоянка такси. NWp
 1135 = atm     Банкоматы. N
 1136 = bank     Банки. NWp
 1137 = bureau_de_change     Пункты обмена валют. N
 1138 = baby_hatch     Место, где можно оставить своего ребёнка (возможно, анонимно). Актуально 
                       для некоторых стран, где это законно. Детский дом, интернат. NWp
 1139 = clinic     Больницы, крупные поликлиники. NWp
 1140 = dentist     Стоматологические клиники. NWp
 1141 = doctors     Медицинские пункты, поликлиники. NWp
 1142 = hospital     Больницы, госпитали. NWp
 1143 = nursing_home     Дома для инвалидов или пожилых людей, которые нуждаются в постоянном 
                         уходе. NWp
 1144 = pharmacy     Аптеки. NWp
 1145 = social_facility     Учреждение, оказывающее социальные услуги (интернаты, детские дома, 
                            дома престарелых, сиделки и т.п.). NWp
 1146 = veterinary     Ветеринарные пункты. NWp
 1147 = arts_centre     Дома творчества, дома культуры, центры искусств, концертные залы. NWp
 1148 = brothel     Публичные дома, бордели. NWp
 1149 = casino     Казино, игровые заведения. NWp
        gambling 
 1150 = cinema     Кинотеатры. NWp
 1151 = community_centre     Места, в основном используемые для проведения праздников и 
                             общественных мероприятий. NWp
 1152 = fountain     Фонтаны. NWp
 1153 = nightclub     Ночные клубы, дискотеки. NWp
 1154 = planetarium     Планетарии. NWp
 1155 = social_centre      Места для свободной некоммерческой деятельности. NWp
 1156 = stripclub     Стрипклуб. NWp
 1157 = swingerclub     Свингер-клубы. NWp
 1158 = theatre     Театры. NWp
 1159 = animal_boarding     Место, где можно оставить свое домашнее животное на время. NWp
 1160 = animal_shelter     Приют для животных. NWp
 1161 = bench     Скамейки для отдыха. N
 1162 = clock     Уличные, фасадные, башенные часы. N
 1163 = courthouse     Суды. NWp
 1164 = coworking_space     Офис совместной работы (co-working). Место, куда люди могут прийти 
                            поработать (возможно, требуется денежный взнос). Не ограничено одним 
                            нанимателем. NWp
 1165 = crematorium     Крематории. NWp
 1166 = crypt     Склеп. Каменная камера или подвал под полом усыпальницы, в которой может 
                  находиться саркофаг, гроб или мощи. NWp
 1167 = dive_centre     ??? NWp
 1168 = dojo     Додзё. Место для тренировок в одном из японских боевых искусств. NWp
 1169 = embassy     Посольства. NWp
 1170 = fire_station     Пожарные станции. NWp
 1171 = grave_yard     Небольшие захоронения, погосты. Обычно позади церквей, часовен. NWp
 1172 = hunting_stand     Охотничьи вышки. NWp
 1173 = internet_cafe     Интернет-кафе. NWp
 1174 = kneipp_water_cure     Ножная ванна для водолечения по методу Кнайпа. Обычно это бассейн 
                              с холодной водой и поручнями. Популярна в немецкоговорящих странах. 
                              NWp  
 1175 = marketplace     Площади, отведенные под торговлю. Рынки. Базары. WWp
 1176 = photo_booth     Фотокиоск – автомат, делающий мгновенные фотоснимки. N
 1177 = place_of_worship     Культовые сооружения — церковь, синагога, мечеть и т. д. NWp
 1178 = police     Полицейские участки, отделения милиции. NWp
 1179 = post_box     Почтовые ящики. N
 1180 = post_office     Почтовые отделения и почтамты. NWp
 1181 = prison     Тюрьмы. NWp
 1182 = ranger_station     Национальный парк. NWp
 1183 = recycling     Места сбора отходов, мусора для вторичной переработки (бутылок, пивных банок,
                      макулатуры и т. п.) NWp
 1184 = rescue_station     Спасательные станции (без пожарных расчётов). NWp
 1185 = sauna     Сауна (баня). NWp
 1186 = shelter     Навесы, шалаши, остановки транспорта или похожие укрытия. NWp
 1187 = shower     Общественная баня или душ. NWp
 1188 = telephone     Телефоны. N
 1189 = toilets     Туалеты. NWp
 1190 = townhall     Городская администрация. NWp
 1191 = vending_machine     Автоматы по продаже билетов, напитков и пр. товаров. N
 1192 = waste_basket     Урны для мусора. N
 1193 = waste_disposal     Мусорки. Помойки. Места с большими контейнерами для мусора. N
 1194 = watering_place     Поилки для животных. Аналог amenity=drinking_water, но не предназначены 
                           для человека. N
 1196 = water_point     Место, где можно набрать большое количество питьевой воды. N
 1197 = ev_charging     Место зарядки электромобилей. N
 1198 = firepit     Устаревший тег. Для кострищ. NWp
 1199 = public_building     ??? NWp  
 1200 = blood_donation     Донорские пункты, где можно сдать кровь, плазму и/или тромбоциты, а 
                           также, возможно, образцы стволовых клеток. NWp
 1201 = studio     Студия. NWp
 1202 = swimming_pool     Плавательный бассейн. NWp
 1203 = register_office     Реистратура, бюро найма, бюро регистрации. NWWp
 1204 = vehicle_ramp     Автомобильная рампа (наклонный заезд). NWWp
 1205 = hookah_lounge     Кольянная, кольянный салон. NWp
 1206 = hostel     Хостел. NWp
 1207 = payment_terminal     Платежный терминал. N
 1208 = training     Место, в котором проходят обучение чему-либо. N
 1209 = sanatorium     Санаторий. NWp
 1210 = car_sharing    Вид краткосрочной аренды автомобиля с поминутной или почасовой оплатой, обычно 
                       используемый для коротких внутригородских поездок.  

                               ЭКСТРЕННЫЕ СЛУЖБЫ (emergency) [1300 - 1399]

 1300 = ambulance_station     Станция неотложной помощи: там отстаиваются машины скорой помощи, 
                              хранится медицинское оборудование, средства персональной защиты и 
                              медикаменты. NWp
 1301 = defibrillator     Автоматический дефибриллятор — устройство первой помощи, автоматизирующее
                          диагностику угрожающей жизни сердечной аритмии и осуществляющее 
                          дефибрилляцию. N
 1302 = fire_extinguisher     Огнетушитель, средство активной противопожарной защиты для 
                              устранения небольшого огня, часто в экстренных ситуациях. N
 1303 = fire_flapper     ??? N
 1304 = fire_hose     Пожарный шланг, доставляет воду или другие средства (например, пену) к огню 
                      для его устранения. N
 1305 = fire_hydrant     Пожарный гидрант -- средство активной противопожарной защиты, источник 
                         воды во многих застроенных территориях, позволяет пожарным подключаться 
                         к водопроводу для помощи в тушении пожара. N
 1306 = water_tank     Пожарный водоём -- искусственный или естественный источник (хранилище) воды, 
                       используемой при тушении пожаров. N
 1307 = lifeguard_base     Здание базы спасателей. Место хранения транспорта и оборудования, а 
                           также центр связи. NWp
 1308 = lifeguard_tower     Вышка, с которой спасатель наблюдает за купающимися, чтобы 
                            предотвратить случаи утопания и другие опасности. NWp
        lifeguard_platform     Платформа, с которой спасатель наблюдает за купающимися. Меньше 
                               вышки и обычно без стен и крыши. NWp
        lifeguard_place     Место, где дежурит спасатель, но без какого-либо строения (вышки или 
                            платформы). N
 1309 = life_ring     Спасательный круг. N
 1310 = assembly_point     Место сбора при возникновении чрезвычайной ситуации. NWp
 1311 = access_point     Точка экстренной помощи для районов, куда доступ может быть затруднён. N
 1312 = phone     Телефон экстренной связи, для звонков в службы помощи, часто находится в зонах 
                  повышенной опасности. N
 1313 = siren     Сирена, умеет выть. Большинство современных сирен оповещают о боевых действиях, 
                  воздушной атаке или приближении торнадо. N
 1314 = ses_station     State Emergency Service — австралийская волонтёрская организация, предоставляющая 
                        помощь во время (и после) природных (или иных) катастроф. NWp
 1315 = yes     Экстренная служба (обобщенное понятие). NWWp

                               ОФИСЫ (office) [1400 - 1449]

 1400 = любого типа офисы. NWp

                               МАГАЗИНЫ, УСЛУГИ (shop) [1450 - 1499]

 1450 = любого типа магазины. NWp

                               МАСТЕРСКИЕ (craft) [1500 - 1549]

 1500 = любого типа мастерские. NWp

                               ТУРИЗМ (tourism) [1600 - 1699]

 1600 = alpine_hut     Домики в горах для альпинистов. NWp
 1601 = apartment     Мебелированные квартиры могут сдаваться на короткий период, применимо для 
                      отдельной квартиры или множества квартир в доме. NWp
 1602 = aquarium     Аквариумы. NWp
 1603 = artwork     Выставленные на общественное обозрение произведения изобразительного искусства.
                    NWWp
 1604 = attraction     Места так или иначе интересные для туристов. Общее обозначение, обычно 
                       требует уточнения. NWp
 1605 = camp_site     Кемпинги, палаточные городки, места для установки палаток, туристические 
                      стоянки. NWp
 1606 = caravan_site     Пункты на караванном пути, где можно встать на ночь или дольше. NWp
 1607 = chalet     Съёмные дома. NWp
 1608 = gallery     Картинные галереи или музеи изобразительного искусства. NWp
 1609 = guest_house     Походные дома, гостевые дома — места, где можно снять место на ночь и 
                        позавтракать. NWp
 1610 = hostel     Общежития, Хостелы, молодёжные гостиницы. От гостиниц отличаются тем, что в 
                   одной комнате могут проживать незнакомые (изначально) люди. NWp
 1611 = hotel     Гостиницы, отели, пансионы. NWp
 1612 = information     Информационные киоски, стенды, терминалы, карты. NWp
 1613 = motel     Мотели — гостиницы для автотуристов. NWp
 1614 = museum     Музеи. NWp
 1615 = picnic_site     Места для отдыха на природе, пикника. Могут быть оборудованы столами, 
                        скамейками, и т. п. NWp
 1616 = theme_park     Парки аттракционов, лунапарки. NWp
 1617 = viewpoint     Места, с хорошим обзором, живописным видом, смотровые площадки. N
 1618 = wilderness_hut     Удаленная избушка в лесной глуши или просто в уединенных местах 
                           отдаленных от населенных пунктов. Обязательно есть стены, крыша, 
                           спальные места, часто присутствует печь. В Сибири охотничья, лесная 
                           изба (приют) обычно без присутствия хозяина, построившего помещение. NWp
 1619 = zoo     Зоопарки, зоосады. NWp
 1620 = yes     Другие места для туристов. NWp
 1621 = tree_shrine     Отдельное стоящее дерево для поклонения или изображение образа поклонения, 
                        установленное на дереве. N

                               ИСТОРИЧЕСКИЕ МЕСТА (historic) [1700 - 1799]

 1700 = aircraft     Списанный самолёт, использующийся не по прямому назначнению как музейный 
                     экспонат, памятник или помещение. Располагается на постоянном месте. NWp
 1701 = archaeological_site     Места раскопок, открытые для посещения. NWp
 1702 = battlefield     Поля сражений, места битв. Могут быть как на суше, так и на море. NWp
 1703 = boundary_stone     Камень обозначающий историческую границу. N
 1704 = building     ??? NWp
 1705 = cannon     Имеющая историческое значение или более не использующаяся пушка. Обычно 
                   находятся в фортах или на полях сражений. N
 1706 = castle     Средневековые военные укрепления: замки, кремли, форты, крепости. NWp
 1707 = city_gate     Городские ворота. NWp
 1708 = citywalls     Городская стена — фортификационное сооружение для защиты города или 
                      поселения от нападения врагов. WWp
 1709 = farm     Историческая ферма, сохранившаяся в своём исходном состоянии. NWp
 1710 = fort     Форт. NWp
 1711 = highwater_mark     ??? N
 1712 = locomotive     Списанный локомотив, обычно стоящий на одном и том же месте. NWp
 1713 = manor     Историческая усадьба, особняк или дом дворян/землевладельцев. NWp
 1714 = memorial     Памятники (небольшие), мемориалы, памятные плиты, таблички. NWp
 1715 = milestone     Имеющий историческое значение указатель расстояния до важного места 
                      назначения. N
 1716 = monument     Монументы. NWp
 1717 = ruins     Развалины, в значительной мере разрушенные крепости, дома. NWp
 1718 = rune_stone     Рунические камни. N
 1719 = ship     Судно-памятник, музей. NWp
 1720 = wayside_cross     Исторический (обычно христианский) крест. Часто встречаются вдоль дорог 
                          на юге Германии, в Австрии и, возможно, в других странах. NWp
 1721 = wayside_shrine     Религиозная святыня, часто имеющая религиозное происхождение. Часто 
                           встречаются вдоль дорог в России, на юге Германии, в Австрии и, 
                           возможно, в других странах. NWp
 1722 = wreck     Суда, потерпевшие крушение. NWp
 1723 = yes     Используется для указания исторического интереса к чему-либо, описанному другими 
                тегами. NWp
 1724 = gallows     Виселица: сооружение для казни через повешение. NR
 1725 = building     ??? NWp
 1726 = monastery     Имеющий историческое значение монастырь. NWp
 1727 = optical_telegraph     Имеющий историческое значение оптический телеграф. NWp
 1728 = pillory     Позорный столб: конструкция, предназначавшаяся для наказания лиц, осуждённых судами 
                    низшей инстанции. N
 1729 = tomb     Могила, имеющая историческое значение. NWp
 1730 = house     Дом, жилище, здание. NWp
 1731 = arch     Арка, свод здания. NWWp
 1732 = palace     Дворец. NWp
 1733 = fountain     Фонтан. NWp
 1734 = castle_wall     Стена замка. WWp

                               ЗЕМЛЕПОЛЬЗОВАНИЕ, НАЗНАЧЕНИЕ ТЕРРИТОРИИ (landuse) [1800 - 1899]

 1800 = allotments     Земельные участки, предоставленные местным жителям для выращивания овощей 
                       и цветов. Можно использовать для обозначения садоводческих товариществ, 
                       приусадебных участков, огородов. NWp
 1801 = basin     Бассейны стока. NWp
 1802 = brownfield     Расчищенные от строений районы под новую застройку. NWp
 1803 = cemetery     Кладбища. Wp
 1804 = commercial     Деловые районы. NWp
 1805 = construction     Стройки, места, в которых производится сооружение чего-либо. NWp
 1806 = farmland     ??? NWp
 1807 = farmyard     Сельскохозяственные дворы; территории при колхозах, фермах, где расположены 
                     подсобные строения. Wp
 1808 = forest     Земельные участки, закреплённые за лесничествами, в которых регулярно проводятся:
                   - посадка леса;
                   - вырубка;
                   - прореживание и чистка. NWp
 1809 = garages     Гаражи. Одноэтажные прямоугольные строения в виде соединённых боковыми стенками 
                    боксов для хранения автомобилей. Часто гаражи сделаны из кирпича или 
                    металлических листов. Обычно эта область принадлежит гаражному кооперативу, с 
                    собственным названием, председателем, бюджетом, правилами, охраной, и т.д. 
                    Иногда под гаражом хозяин строит подвальное помещение, в котором хранятся 
                    картошка, огурцы или может оборудовать подземную отапливаемую комнату для 
                    посиделок с друзьями. Wp
 1810 = grass     Место, предназначенное для того, что бы там росла трава. NWp
 1811 = greenfield     Районы под застройку, ранее не застраивавшиеся. NWp
 1812 = greenhouse_horticulture     Теплицы (крытая территория для выращивания растений). Wp
 1813 = industrial     Промышленные территории, территории заводов, фабрик, мастерских, промзоны. 
                       NWp
 1814 = landfill     Свалки. NWp
 1815 = meadow     Сенокосные угодья, луга, территории покрытые преимущественно травой и другими 
                   не древесными растениями. NWp
 1816 = military     Зоны военных баз и полигонов. NWp
 1817 = orchard     Искусственные посадки плодовых деревьев и кустарников для пищевой 
                    промышленности. NWp
 1818 = plant_nursery     Искусственные посадки саженцев деревьев и кустарников для выращивания 
                          взрослых растений. Питомники. Wp
 1819 = port     Морские и речные порты, Wp
 1820 = quarry     Места открытой выработки полезных ископаемых, песка, камня, грунта: карьеры, 
                   котлованы. NWp
 1821 = railway     Территории, относящиеся к железнодорожному хозяйству. Wp
 1822 = recreation_ground     Открытые зеленые пространства для общего отдыха, которые могут 
                              включать площадки, сетки и так далее, как правило, муниципальные, 
                              но также, возможно, частные, в колледжах или компаниях. В России, 
                              как правило, не используется. NWp
 1823 = reservoir     Искусственные водоёмы, резервуары. NWp
 1824 = residential     Участки, занятые преимущественно жилыми строениями. NWp
 1825 = retail     Торговые территории, в т.ч. рынки. NWp
 1826 = salt_pond     Соляные разработки. Wp
 1827 = village_green     Общественная территория внутри населенного пункта. Используется для 
                          проведения массовых мероприятий. Как правило представляет из себя газон 
                          или мини-парк. NWp
 1828 = vineyard     Виноградники. NWp
 1829 = conservation     ??? Wp
 1830 = pasture     ??? NWp
 1831 = asphalt     Асфальтовое покрытие. NWp
 1832 = churchyard     Погост, кладбище, церковный двор. NWp  

                               ВОЕННЫЕ ОБЪЕКТЫ (military) [1900 - 1999]

 1900 = airfield     Военные аэродромы, NWp
 1901 = ammunition     ??? NWp
 1902 = bunker     Укрепления: бункеры, огневые точки, блиндажи. Также исторические. NWp
 1903 = barracks     Казармы. NWp
 1904 = checkpoint     Контрольно-пропускной пункт. Место доступа в запрещённую или охраняемую 
                       зону, где гражданские посетители и транспорт проверяются военными. N
 1905 = danger_area     Полигоны, опасные зоны, в которых запрещено находиться гражданским. NWp
 1906 = naval_base     Военно-морские базы. NWp
 1907 = nuclear_explosion_site     ??? NWp
 1908 = obstacle_course     Армейская полоса препятствий. WWp
 1909 = office     ??? NWp
 1910 = range     Стрельбища, стрелковые, бомбометательные полигоны. NWp
 1911 = training_area     Место для тренировки солдат и испытания оружия и других военных 
                          технологий. Wp
 1912 = trench     ??? NWp
 1913 = headquarters     Штабквартира. NWWp
 1914 = yes     Военный объект. NWWp

                               ПРИРОДНЫЕ ОБРАЗОВАНИЯ (natural) [2000 - 2199]

 2000 = wood     Лесные массивы и скопления деревьев за исключением территорий лесничеств и 
                 охотохозяйств, обозначаемых landuse=forest, в том числе:
                 - лесозаградительные полосы в полях, вдоль дорог и т.п.;
                 - лесные массивы, закреплённые за лесничествами, в которых не проводятся вырубка 
                 и лесопосадка, в т.ч. охотохозяйства;
                 - лесные массивы с неизвестным статусом;
                 - отдельные небольшие группы деревьев (см. также natural=tree);
                 - лесопарковые зоны, бульвары, парки, заказники (та их часть, которая покрыта 
                 деревьями; для обозначения всей озеленённой территории могут использоваться 
                 теги leisure=park и landuse=natural_reserve). NWp
 2001 = tree_row     Линия деревьев. W
 2002 = tree     Отдельно стоящие или выдающиеся деревья. N
 2003 = scrub     Кустарниковые заросли. NWp
 2004 = heath     Обширная, довольно ровная область необрабатываемой земли, обычно с грубой 
                  неплодородной почвой. Как правило имеется растительность в виде мелких 
                  кустарников семейства Вересковые, папоротника. NWp
 2005 = moor     Холмистая местность, характеризующаяся низкой растительностью на закислённых 
                 почвах. NWp
 2006 = grassland     Природные районы, где преобладают злаки и другие травянистые (не древесные) 
                      растения. Исключение составляют посевные площади и водно-болотные угодия. Wp
 2007 = fell     Территории в горах выше линии деревьев, поросшие мелким кустарником, травами. NWp
 2008 = bare_rock     Область с редкой или отсутствующей растительностью, так что становится видна 
                      коренная порода. Wp
 2009 = scree     Каменистые осыпи. NWp
 2010 = shingle     Скопление скруглённых водной эрозией камней типа гальки или гравия, иногда 
                    более крупных. NWp
 2011 = sand     Поверхность земли покрытая главным образом песком, без или с незначительной 
                 растительностью. NWp
 2012 = mud     Ил, глина. NWp
 2013 = water     Водные поверхности: озёра, водоемы и т.д. Рисуя водоемы нужно придерживаться 
                  следующего правила для корректной отрисовки: земля - слева по ходу движения, 
                  вода - справа. Т.е. водоём нужно рисовать по часовой стрелке. Wp
 2014 = wetland     Затопленные местности: болота, топи, марши, лаймы. Wp
 2015 = glacier     Нетающие ледники. NWp
 2016 = bay     Заливы, бухты. NWp
 2017 = beach     Отлогие береговые зоны, приливные зоны, покрытые камнями, галькой, песком. NWp
 2018 = coastline     Береговые линии. Используется, когда линии не замкнуты. Рисуем, 
                      придерживаясь правила: земля — слева по ходу движения, вода — справа. W
 2019 = spring     Источники, родники. N
 2020 = hot_spring     Горячий источник, созданный выходом геотермальных подземных вод на 
                       поверхность земли. N
 2021 = geyser     Гейзер — источник, характеризующийся периодическим фонтанообразным выбросом 
                   воды и пара. N
 2022 = peak     Вершины гор, холмов. N
 2023 = volcano     Вулканы, как действующие, так и потухшие. N
 2024 = valley     Долина или балка. NW
 2025 = river_terrace     Речная терраса. NWp
 2026 = ridge     Вершина хребта или кряжа. W
 2027 = arete     Острый гребень горы или кряжа. N
 2028 = cliff     Утёсы, отвесные скалы, образовавшиеся под действием прибоя. NWWp
 2029 = saddle     Седловина между холмов. N
 2030 = rock     Этот тег предложен для пометки областей со скалами и небольшими утёсами, которые 
                 можно использовать для целей навигации или которые могут представлять 
                 потенциальную опасность для навигации. NWp
 2031 = stone     Отдельно лежащий камень. N
 2032 = sinkhole     Природная впадина или отверстие в поверхности. NWp 
 2033 = cave_entrance     Входы в пещеры. NWp
 2034 = grass     Трава, газоны. Wp
 
                               ГРАНИЦЫ (boundary) [1550 - 1599]

 1550 = boundary     Границы государств, административные границы: областей, райнонов, 
                     округов, штатов и т. п. WWp
  
                               СПОРТ (sport) [2200 - 2499]

 2200 = 9pin     9-кегельный боулинг. NWp
 2201 = 10pin     10-кегельный боулинг (обычный). NWp
 2202 = american_football     Американский футбол, он же регби. Тег был введён в июне 2010 года 
                               для предотвращения запутывания тегом sport=football. NWp
 2203 = aikido     Айкидо. NWp
 2204 = archery     Стрельбы из лука. NWWp
 2205 = athletics     Лёгкая атлетика, набор спортивных дисциплин, включающий бег, метание, прыжки.
                       NWWp
 2206 = australian_football     Австралийский футбол. NWp
 2207 = badminton     Бадминтон. Игра заключается в перекидывании через сетку волана. Играют 1:1 
                       или 2:2. NWp
 2208 = bandy     ??? NWp
 2209 = base     Бэйсджампинг. Экстремальный вид спорта, в котором используется специальный 
                  парашют для прыжков с фиксированных объектов. NWWp
 2210 = baseball     Бейсбол. NWp
 2211 = basketball     Баскетбол. NWp
 2212 = beachvolleyball     Пляжный волейбол. NWp
 2213 = billiards     Бильярд ??? NWp
 2214 = bmx     ??? NWWp
 2215 = bobsleigh     ??? NWWp
 2216 = boules     ??? NWp
 2217 = bowls     Боулз или игра в шары. На траве, подобна боулингу. NWp
 2218 = boxing     Бокс (олимпийский вид спорта). NWp
 2219 = canadian_football     Канадский футбол. NWWp
 2220 = chess     Шахматы: большие стационарные шахматные доски на открытом воздухе. NWp
 2221 = cliff_diving     ??? N
 2222 = climbing     Скалолазание: искусственные, либо ествественные стенки для лазания. NWp
 2223 = climbing_adventure     ??? NWp
 2224 = cockfighting     ??? NWp
 2225 = cricket     Крикет. NWp
 2226 = croquet     Крокет. NWp
 2227 = curling     Керлинг. NWp
 2228 = cycling     Велосипедный спорт. NWp
 2229 = darts     Дартс. NWp
 2230 = dog_racing     Собачьи бега. NWWp
 2231 = equestrian     Верховая езда: обычно обозначает выездку и конкур, но также включает 
                        зрелищные дисциплины, разнообразные игры и состязания. NWWp
 2232 = fencing     Фехтование. NWp
 2233 = field_hockey     ??? NWp
 2234 = free_flying     Параглайдинг, дельтаплан/...место для взлёта, приземления и т.п. и 
                         соответствующие услуги и имущество. NWp
 2235 = gaelic_games     Гэльские игры, такие как хёрлинг, гэльский футбол, камоги, в которые в 
                          основном играют в Ирландии. Об обозначении отдельных игр из этой 
                          категории смотрите страницу этого тега. NWp
 2236 = golf     Гольф. NWWp
 2237 = gymnastics      Гимнастика. NWp
 2238 = handball     Гантбол. NWp
 2239 = hapkido     ??? NWp
 2240 = horseshoes     Игра в набрасывание лошадиных подков на колья. NWp
 2241 = horse_racing     Лошадиные скачки. NWWp
 2242 = ice_hockey     ??? NWp
 2243 = ice_skating     ??? NWp
 2244 = ice_stock     Айсшток. NWp
 2245 = judo     Дзюдо (олимпийский вид спорта). NWp
 2246 = karting     Картинг. NWWp
 2247 = kitesurfing     Кайтсёрфинг (сёрфинг с воздушным змеем). NWp
 2248 = korfball     Корфбол. NWp
 2249 = model_aerodrome     ??? NWp
 2250 = motocross     ??? NWWp
 2251 = motor     Автомотоспорт. NWWp
 2252 = multi     Универсальные спортплощадки. NWWp
 2253 = netball     ??? NWp
 2254 = obstacle_course     (Полоса препятствий). Ряд физических препятствий для индивидуального 
                             или командного прохождения (обычно с учётом времени). NWWp
 2255 = orienteering     Спортивное ориентирование. NWWp
 2256 = paddle_tennis     Настольный теннис. NWp
 2257 = parachuting     ??? NWp
 2258 = paragliding     Парапланеризм. NWp
 2259 = pelota     Пелота (прообраз современного сквоша). NWp
 2260 = racquet     Игры с ракетками: бадминтон, сквош. NWWp
 2261 = rc_car     Радиоуправляемые машинки. NWWp
 2262 = roller_skating     ??? NWWp
 2263 = rowing     Академическая гребля. NWWp
 2264 = rugby_league     Регби-лиг или регби-13. Одна из двух разновидностей регби, ответвившаяся 
                          от регби-юнион в 1895 году с последующим изменением правил. NWp
 2265 = rugby_union     Регби-юнион (или регби-15, или просто регби), командный контактный вид 
                         спорта, появившийся в Англии в начале XIX века. NWp
 2266 = running     Бег. NWp
 2267 = sailing     ??? NWWp
 2268 = scuba_diving     Подводное плавание, дайвинг. NWWp
 2269 = shooting     Стрельба. NWWp
 2270 = skateboard     Скейтборд. NWWp
 2271 = soccer     Традиционный футбол (соккер). Использовать вместо sport=football воизбежание 
                    путаницы с другими разновидностями. NWp
 2272 = sumo     Суммо. NWp
 2273 = surfing     Сёрфинг. NWWp
 2274 = swimming     Плавание. NWWp
 2275 = table_tennis     Настольный тенис.NWp
 2276 = table_soccer     ??? NWp
 2277 = taekwondo     Таэквондо (олимпийский вид спорта). NWp
 2278 = tennis     Тенис. NWp
 2279 = toboggan     ??? NWp
 2280 = volleyball     Волейбол. NWp
 2281 = water_polo     ??? NWp
 2282 = water_ski     Водные лыжи. NWWp
 2283 = weightlifting     Тяжёлая атлетика (олимпийский вид спорта). NWp
 2284 = wrestling     Борьба (олимпийский вид спорта). NWp
 2285 = yoga     Йога. NWp
 2286 = canoe     Плавание на байдарках и каяках. NWWpR
 2287 = cricket_nets     Сетки для тренировки в крикет. ?
 2288 = diving     Прыжки в воду. ?
 2289 = football     ??? ?
 2290 = hockey     Хоккей. NWpR
 2291 = safety_training     ??? NWpR
 2292 = skating     Бег на коньках, катание на коньках. ?
 2293 = skiing     Бег на лыжах, горные лыжи, сноуборд. NWWpR
 2294 = fitness     Фитнес. NWWpR
 
                                НАСЕЛЕННЫЙ ПУНКТ (place) [2500 - 2549]
 
 2500 = place     Любой населенный пункт. N
 */

public class TypesOfObjects implements Types {

	// ДИАПАЗОНЫ ЗНАЧЕНИЙ ТИПОВ ОБЪКТОВ КАРТЫ
	private static short highway_min = 1;
	private static short highway_max = 99;
	
	private static short barrier_min = 200;
	private static short barrier_max = 299;
	
	private static short building_min = 300;
	private static short building_max = 349;
	
	private static short building_part_min = 350;
	private static short building_part_max = 399;
	
	private static short waterway_min = 400;
	private static short waterway_max = 499;
	
	private static short railway_min = 500;
	private static short railway_max = 599;
	
	private static short aeroway_min = 600;
	private static short aeroway_max = 699;
	
	private static short aerialway_min = 700;
	private static short aerialway_max = 799;
	
	private static short emergency_min = 1300;
	private static short emergency_max = 1399;
	
	private static short natural_min =  2000;
	private static short natural_max = 2199;
	
	private static short place_min = 2500;
	private static short place_max = 2549;
	
//	private static short surface_min = 100;
//	private static short surface_max = 149;
	
//	private static short tracktype_min = 150;
//	private static short tracktype_max = 199;
	
	private static short landuse_min = 1800;
	private static short landuse_max = 1899;
	
	private static short boundary_min = 1550;
	private static short boundary_max = 1599;
	
	private static short power_min = 800;
	private static short power_max = 899;
	
	private static short man_made_min = 900;
	private static short man_made_max = 999;
	
	private static short leisure_min = 1000;
	private static short leisure_max = 1099;
	
	private static short amenity_min = 1100;
	private static short amenity_max = 1299;
	
	private static short office_min = 1400;
	private static short office_max = 1449;
	
	private static short shop_min = 1450;
	private static short shop_max = 1499;
	
	private static short craft_min = 1500;
	private static short craft_max = 1549;
	
	private static short tourism_min = 1600;
	private static short tourism_max = 1699;
	
	private static short historic_min = 1700;
	private static short historic_max = 1799;
	
	private static short military_min = 1900;
	private static short military_max = 1999;
	
	private static short sport_min = 2200;
	private static short sport_max = 2499;
	
	// ОСНОВНЫЕ ТЕГИ
	
	// Дороги (tag = highway)
	private HashMap<String, Short> highway_types;
	// Преграды (tag = barrier)
	private HashMap<String, Short> barrier_types;
	// Здания (tag = building)
	private HashMap<String, Short> building_types;
	// Части здания (tag = building:part)
	private HashMap<String, Short> building_part_types;
	// Гидрография проточных вод (tag = waterway)
	private HashMap<String, Short> waterway_types;
	// Рельсовые пути вод (tag = railway)
	private HashMap<String, Short> railway_types;
	// Воздушный транспорт (tag = aeroway)
	private HashMap<String, Short> aeroway_types; 
	// Канатная дорога (tag = aerialway)
	private HashMap<String, Short> aerialway_types;	
	// Экстренные службы (tag = emergency)
	private HashMap<String, Short> emergency_types;	
	// Природные образования (tag = natural)
	private HashMap<String, Short> natural_types; 	
	
	// НЕОСНОВНЫЕ ТЕГИ
	
	// Покрытие дороги (tag = surface)
	private HashMap<String, Short> surface_types;
	// Покрытие проселочной дороги (tag = tracktype)
	private HashMap<String, Short> tracktype_types; 
	// Землепользование, назначение территории (tag = landuse)
	private HashMap<String, Short> landuse_types;
	// Грвницы (tag = boundary)
	private HashMap<String, Short> boundary_types; 
	// Энергетика (tag = power)
	private HashMap<String, Short> power_types;
	// Искусственные сооружения (tag = man_made)
	private HashMap<String, Short> man_made_types; 
	// Места проведения досуга (tag = leisure)
	private HashMap<String, Short> leisure_types;
	// Инфраструктура, благоустройство (tag = amenity)
	private HashMap<String, Short> amenity_types;
	// Офисы (tag = office)
	private HashMap<String, Short> office_types;
	// Магазины (tag = shop)
	private HashMap<String, Short> shop_types;
	// Мастерские (tag = craft)
	private HashMap<String, Short> craft_types;
	// Туризм (tag = tourism)
	private HashMap<String, Short> tourism_types;
	// Исторические места (tag = historic)
	private HashMap<String, Short> historic_types;
	// Военные объекты (tag = military)
	private HashMap<String, Short> military_types;
	// Спорт (tag = sport)
	private HashMap<String, Short> sport_types;
	// Населенный пункт (только для точек)
	private HashMap<String, Short> place_types; 
	
	// Описание типов объектов
//	private HashMap<String, String> name_types;
	
//	public TypesOfObjects() {}
	
	private short initSurfaceTypes(String v) {
		surface_types = new HashMap<String, Short>();
		
		surface_types.put("paved", (short) 100);
		surface_types.put("asphalt", (short) 101);
		surface_types.put("sett", (short) 102);
		surface_types.put("concrete", (short) 103);
		surface_types.put("paving_stones", (short) 104);
		surface_types.put("cobblestone", (short) 105);
		surface_types.put("metal", (short) 106);
		surface_types.put("wood", (short) 107);
		surface_types.put("unpaved", (short) 108);
		surface_types.put("compacted", (short) 109);
		surface_types.put("salt", (short) 110);
		surface_types.put("woodchips", (short) 111);
		surface_types.put("tartan", (short) 112);
		surface_types.put("clay", (short) 113);
		surface_types.put("metal_grid", (short) 114);
		surface_types.put("ice", (short) 115);
		surface_types.put("decoturf", (short) 116);
		surface_types.put("paving_stones:30", (short) 117);
		surface_types.put("paving_stones:20", (short) 118);
		surface_types.put("granite", (short) 119);
		
		return (short) surface_types.get(v);
	}
	
	private short initTracktypeTypes(String v) {
		tracktype_types = new HashMap<String, Short>();
		
		tracktype_types.put("grade1", (short) 150);
		tracktype_types.put("grade2", (short) 151);
		tracktype_types.put("grade3", (short) 152);
		tracktype_types.put("grade4", (short) 153);
		tracktype_types.put("grade5", (short) 154);
		
		return (short) tracktype_types.get(v);
	}
	
	private short initHighwayTypes(String v) {
		highway_types = new HashMap<String, Short>();
		
		// Типы дорог
		highway_types.put("motorway", (short) 1);		
		highway_types.put("primary", (short) 2);		
		highway_types.put("secondary", (short) 3);		
		highway_types.put("tertiary", (short) 4);		
		highway_types.put("unclassified", (short) 5);		
		highway_types.put("residential", (short) 6);		
		highway_types.put("track", (short) 7); 
		highway_types.put("bridleway", (short) 8);
		highway_types.put("raceway", (short) 9);
		highway_types.put("road", (short) 10); 
		highway_types.put("footway", (short) 11);
		highway_types.put("steps", (short) 12);
		highway_types.put("path", (short) 13);
		highway_types.put("cycleway", (short) 14);
		highway_types.put("proposed", (short) 15);
		highway_types.put("construction", (short) 16);
		highway_types.put("bus_stop", (short) 17);
		highway_types.put("crossing", (short) 18); 
		highway_types.put("elevator", (short) 19);
		highway_types.put("give_way", (short) 20);
		highway_types.put("mini_roundabout", (short) 21);
		highway_types.put("passing_place", (short) 22);
		highway_types.put("rest_area", (short) 23);
		highway_types.put("speed_camera", (short) 24);
		highway_types.put("street_lamp", (short) 25);
		highway_types.put("services", (short) 26);
		highway_types.put("traffic_signals", (short) 27);
		highway_types.put("turning_circle", (short) 28);
		highway_types.put("ford", (short) 29);
		highway_types.put("winter_road", (short) 30);
		highway_types.put("stop", (short) 31);
		highway_types.put("emergency_access_point", (short) 32);
		highway_types.put("escape", (short) 33);
		highway_types.put("platform", (short) 34);
		highway_types.put("traffic_calming", (short) 35);
		highway_types.put("area", (short) 36);
		highway_types.put("surface", (short) 37);
		
		return (short) highway_types.get(v);
	}
		
	private short initManMadeTypes(String v) {
		man_made_types = new HashMap<String, Short>();
		
		man_made_types.put("adit", (short) 900);
		man_made_types.put("beacon", (short) 901);
		man_made_types.put("breakwater", (short) 902);
		man_made_types.put("bridge", (short) 903);
		man_made_types.put("bunker_silo", (short) 904);
		man_made_types.put("campanile", (short) 905);
		man_made_types.put("chimney", (short) 906);
		man_made_types.put("communications_tower", (short) 907);
		man_made_types.put("crane", (short) 908);
		man_made_types.put("cutline", (short) 909);
		man_made_types.put("clearcut", (short) 910);
		man_made_types.put("embankment", (short) 911);
		man_made_types.put("dyke", (short) 912);
		man_made_types.put("flagpole", (short) 913);
		man_made_types.put("gasometer", (short) 914);
		man_made_types.put("groyne", (short) 915);
		man_made_types.put("hot_water_tank", (short) 916);
		man_made_types.put("lighthouse", (short) 917);
		man_made_types.put("mast", (short) 918);
		man_made_types.put("mineshaft", (short) 919);
		man_made_types.put("monitoring_station", (short) 920);
		man_made_types.put("obelisk", (short) 921);
		man_made_types.put("observatory", (short) 922);
		man_made_types.put("petroleum_well", (short) 923);
		man_made_types.put("pier", (short) 924);
		man_made_types.put("pipeline", (short) 925);
		man_made_types.put("reservoir_covered", (short) 926);
		man_made_types.put("storage_tank", (short) 927);
		man_made_types.put("surveillance", (short) 928);
		man_made_types.put("survey_point", (short) 929);
		man_made_types.put("telescope", (short) 930);
		man_made_types.put("tower", (short) 931);
		man_made_types.put("wastewater_plant", (short) 932);
		man_made_types.put("watermill", (short) 933);
		man_made_types.put("water_tower", (short) 934);
		man_made_types.put("water_well", (short) 935);
		man_made_types.put("water_tap", (short) 936);
		man_made_types.put("water_works", (short) 937);
		man_made_types.put("windmill", (short) 938);
		man_made_types.put("works", (short) 939);
		man_made_types.put("kiln", (short) 940);
		man_made_types.put("offshore_platform", (short) 941);
		man_made_types.put("silo", (short) 942);
		man_made_types.put("street_cabinet", (short) 943);
		man_made_types.put("yes", (short) 944);
		man_made_types.put("antenna", (short) 945);
		man_made_types.put("slip", (short) 946);
		man_made_types.put("address_nameboard", (short) 947);
		
		return (short) man_made_types.get(v);
	}
	
	private short initLeisureTypes(String v) {
		leisure_types = new HashMap<String, Short>();
		
		leisure_types.put("adult_gaming_centre", (short) 1000);
		leisure_types.put("beach_resort", (short) 1001);
		leisure_types.put("bandstand", (short) 1002);
		leisure_types.put("bird_hide", (short) 1003);
		leisure_types.put("common", (short) 1004);
		leisure_types.put("dance", (short) 1005);
		leisure_types.put("dog_park", (short) 1006);
		leisure_types.put("firepit", (short) 1007);
		leisure_types.put("fishing", (short) 1008);
		leisure_types.put("fitness_centre", (short) 1009);
		leisure_types.put("garden", (short) 1010);
		leisure_types.put("golf_course", (short) 1011);
		leisure_types.put("hackerspace", (short) 1012);
		leisure_types.put("horse_riding", (short) 1013);
		leisure_types.put("ice_rink", (short) 1014);
		leisure_types.put("marina", (short) 1015);
		leisure_types.put("miniature_golf", (short) 1016);
		leisure_types.put("nature_reserve", (short) 1017);
		leisure_types.put("park", (short) 1018);
		leisure_types.put("picnic_table", (short) 1019);
		leisure_types.put("pitch", (short) 1020);
		leisure_types.put("playground", (short) 1021);
		leisure_types.put("slipway", (short) 1022);
		leisure_types.put("sports_centre", (short) 1023);
		leisure_types.put("stadium", (short) 1024);
		leisure_types.put("summer_camp", (short) 1025);
		leisure_types.put("swimming_area", (short) 1026);
		leisure_types.put("swimming_pool", (short) 1027);
		leisure_types.put("track", (short) 1028);
		leisure_types.put("water_park", (short) 1029);
		leisure_types.put("wildlife_hide", (short) 1030);
		leisure_types.put("sauna", (short) 1031);
		leisure_types.put("recreation_ground", (short) 1032);
		
		return (short) leisure_types.get(v);
	}
	
	private short initBarrierTypes(String v) {
		barrier_types = new HashMap<String, Short>();
		
		barrier_types.put("cable_barrier", (short) 200);
		barrier_types.put("city_wall", (short) 201);
		barrier_types.put("ditch", (short) 202);
		barrier_types.put("fence", (short) 203);
		barrier_types.put("guard_rail", (short) 204);
		barrier_types.put("handrail", (short) 205);
		barrier_types.put("hedge", (short) 206);
		barrier_types.put("kerb", (short) 207);
		barrier_types.put("retaining_wall", (short) 208);
		barrier_types.put("tank_trap", (short) 209);
		barrier_types.put("wall", (short) 210);
		barrier_types.put("block", (short) 211);
		barrier_types.put("bollard", (short) 212);
		barrier_types.put("border_control", (short) 213);
		barrier_types.put("bump_gate", (short) 214);
		barrier_types.put("bus_trap", (short) 215);
		barrier_types.put("cattle_grid", (short) 216);
		barrier_types.put("chain", (short) 217);
		barrier_types.put("cycle_barrier", (short) 218);
		barrier_types.put("debris", (short) 219);
		barrier_types.put("entrance", (short) 220);
		barrier_types.put("full-height_turnstile", (short) 221);
		barrier_types.put("gate", (short) 222);
		barrier_types.put("hampshire_gate", (short) 223);
		barrier_types.put("height_restrictor", (short) 224);
		barrier_types.put("horse_stile", (short) 225);
		barrier_types.put("jersey_barrier", (short) 226);
		barrier_types.put("kent_carriage_gap", (short) 227);
		barrier_types.put("kissing_gate", (short) 228);
		barrier_types.put("lift_gate", (short) 229);
		barrier_types.put("log", (short) 230);
		barrier_types.put("motocycle_barrier", (short) 231);
		barrier_types.put("rope", (short) 232);
		barrier_types.put("sally_port", (short) 233);
		barrier_types.put("spikes", (short) 234);
		barrier_types.put("stile", (short) 235);
		barrier_types.put("sump_buster", (short) 236);
		barrier_types.put("swing_gate", (short) 237);
		barrier_types.put("toll_booth", (short) 238);
		barrier_types.put("turnstile", (short) 239);
		barrier_types.put("yes", (short) 240);
		barrier_types.put("wood_fence", (short) 241);
		barrier_types.put("wicket_gate", (short) 242);
		
		return (short) barrier_types.get(v);
	}
	
	private short initBuildingTypes(String v) {
		building_types = new HashMap<String, Short>();
		
		building_types.put("building", (short) 300);
		building_types.put("entrance", (short) 301);
		
		return (short) building_types.get(v);
	}
	
	private short initBuildingPartTypes(String v) {
		building_part_types = new HashMap<String, Short>();
		
		building_part_types.put("yes", (short) 350);
		
		return (short) building_part_types.get(v);
	}
	
	private short initAmenityTypes(String v) {
		amenity_types = new HashMap<String, Short>();
		
		amenity_types.put("bar", (short) 1100);
		amenity_types.put("bbq", (short) 1101);
		amenity_types.put("biergarten", (short) 1102);
		amenity_types.put("cafe", (short) 1103);
		amenity_types.put("drinking_water", (short) 1104);
		amenity_types.put("fast_food", (short) 1105);
		amenity_types.put("food_court", (short) 1106);
		amenity_types.put("ice_cream", (short) 1107);
		amenity_types.put("pub", (short) 1108);
		amenity_types.put("restaurant", (short) 1109);
		amenity_types.put("college", (short) 1110);
		amenity_types.put("kindergarten", (short) 1111);
		amenity_types.put("library", (short) 1112);
		amenity_types.put("public_bookcase", (short) 1113);
		amenity_types.put("school", (short) 1114);
		amenity_types.put("music_school", (short) 1115);
		amenity_types.put("driving_school", (short) 1116);
		amenity_types.put("language_school", (short) 1117);
		amenity_types.put("university", (short) 1118);
		amenity_types.put("bicycle_parking", (short) 1119);
		amenity_types.put("bicycle_repair_station", (short) 1120);
		amenity_types.put("bicycle_rental", (short) 1121);
		amenity_types.put("boat_sharing", (short) 1122);
		amenity_types.put("bus_station", (short) 1123);
		amenity_types.put("car_rental", (short) 1124);
		amenity_types.put("car_wash", (short) 1125);
		amenity_types.put("charging_station", (short) 1126);
		amenity_types.put("ferry_terminal", (short) 1127);
		amenity_types.put("fuel", (short) 1128);
		amenity_types.put("grit_bin", (short) 1129);
		amenity_types.put("motorcycle_parking", (short) 1130);
		amenity_types.put("parking", (short) 1131);
		amenity_types.put("parking_entrance", (short) 1132);
		amenity_types.put("parking_space", (short) 1133);
		amenity_types.put("taxi", (short) 1134);
		amenity_types.put("atm", (short) 1135);
		amenity_types.put("bank", (short) 1136);
		amenity_types.put("bureau_de_change", (short) 1137);
		amenity_types.put("baby_hatch", (short) 1138);
		amenity_types.put("clinic", (short) 1139);
		amenity_types.put("dentist", (short) 1140);
		amenity_types.put("doctors", (short) 1141);
		amenity_types.put("hospital", (short) 1142);
		amenity_types.put("nursing_home", (short) 1143);
		amenity_types.put("pharmacy", (short) 1144);
		amenity_types.put("social_facility", (short) 1145);
		amenity_types.put("veterinary", (short) 1146);
		amenity_types.put("arts_centre", (short) 1147);
		amenity_types.put("brothel", (short) 1148);
		amenity_types.put("casino", (short) 1149);
		amenity_types.put("cinema", (short) 1150);
		amenity_types.put("community_centre", (short) 1151);
		amenity_types.put("fountain", (short) 1152);
		amenity_types.put("nightclub", (short) 1153);
		amenity_types.put("planetarium", (short) 1154);
		amenity_types.put("social_centre", (short) 1155);
		amenity_types.put("stripclub", (short) 1156);
		amenity_types.put("swingerclub", (short) 1157);
		amenity_types.put("theatre", (short) 1158);
		amenity_types.put("animal_boarding", (short) 1159);
		amenity_types.put("animal_shelter", (short) 1160);
		amenity_types.put("bench", (short) 1161);
		amenity_types.put("clock", (short) 1162);
		amenity_types.put("courthouse", (short) 1163);
		amenity_types.put("coworking_space", (short) 1164);
		amenity_types.put("crematorium", (short) 1165);
		amenity_types.put("crypt", (short) 1166);
		amenity_types.put("dive_centre", (short) 1167);
		amenity_types.put("dojo", (short) 1168);
		amenity_types.put("embassy", (short) 1169);
		amenity_types.put("fire_station", (short) 1170);
		amenity_types.put("grave_yard", (short) 1171);
		amenity_types.put("hunting_stand", (short) 1172);
		amenity_types.put("internet_cafe", (short) 1173);
		amenity_types.put("kneipp_water_cure", (short) 1174);
		amenity_types.put("marketplace", (short) 1175);
		amenity_types.put("photo_booth", (short) 1176);
		amenity_types.put("place_of_worship", (short) 1177);
		amenity_types.put("police", (short) 1178);
		amenity_types.put("post_box", (short) 1179);
		amenity_types.put("post_office", (short) 1180);
		amenity_types.put("prison", (short) 1181);
		amenity_types.put("ranger_station", (short) 1182);
		amenity_types.put("recycling", (short) 1183);
		amenity_types.put("rescue_station", (short) 1184);
		amenity_types.put("sauna", (short) 1185);
		amenity_types.put("shelter", (short) 1186);
		amenity_types.put("shower", (short) 1187);
		amenity_types.put("telephone", (short) 1188);
		amenity_types.put("toilets", (short) 1189);
		amenity_types.put("townhall", (short) 1190);
		amenity_types.put("vending_machine", (short) 1191);
		amenity_types.put("waste_basket", (short) 1192);
		amenity_types.put("waste_disposal", (short) 1193);
		amenity_types.put("watering_place", (short) 1194);
		amenity_types.put("water_point", (short) 1196);
		amenity_types.put("ev_charging", (short) 1197);
		amenity_types.put("firepit", (short) 1198);
		amenity_types.put("public_building", (short) 1199);
		amenity_types.put("healthcare", (short) 1200);
		amenity_types.put("studio", (short) 1201);
		amenity_types.put("swimming_pool", (short) 1202);
		amenity_types.put("register_office", (short) 1203);		
		amenity_types.put("vehicle_ramp", (short) 1204);
		amenity_types.put("hookah_lounge", (short) 1205);
		amenity_types.put("hostel", (short) 1206);
		amenity_types.put("payment_terminal", (short) 1207);
		amenity_types.put("training", (short) 1208);
		amenity_types.put("sanatorium", (short) 1209);
		amenity_types.put("car_sharing", (short) 1210);
		
		return (short) amenity_types.get(v);
	}
		
	private short initBoundaryTypes(String v) {
		boundary_types = new HashMap<String, Short>();
		
		boundary_types.put("boundary", (short) 1550);
		
		return (short) boundary_types.get(v);
	}
	
	private short initOfficeTypes(String v) {
		office_types = new HashMap<String, Short>();
		
		office_types.put("office", (short) 1400);
		
		return (short) office_types.get(v);
	}
	
	private short initShopTypes(String v) {
		shop_types = new HashMap<String, Short>();
		
		shop_types.put("shop", (short) 1450);
		
		return (short) shop_types.get(v);
	}
	
	private short initCraftTypes(String v) {
		craft_types = new HashMap<String, Short>();
		
		craft_types.put("craft", (short) 1500);
		
		return (short) craft_types.get(v);
	}
	
	private short initSportTypes(String v) {
		sport_types = new HashMap<String, Short>();
		
		sport_types.put("9pin", (short) 2200);
		sport_types.put("10pin", (short) 2201);
		sport_types.put("american_football", (short) 2202);
		sport_types.put("aikido", (short) 2203);
		sport_types.put("archery", (short) 2204);
		sport_types.put("athletics", (short) 2205);
		sport_types.put("australian_football", (short) 2206);
		sport_types.put("badminton", (short) 2207);
		sport_types.put("bandy", (short) 2208);
		sport_types.put("base", (short) 2209);
		sport_types.put("baseball", (short) 2210);
		sport_types.put("basketball", (short) 2211);
		sport_types.put("beachvolleyball", (short) 2212);
		sport_types.put("billiards", (short) 2213);
		sport_types.put("bmx", (short) 2214);
		sport_types.put("bobsleigh", (short) 2215);
		sport_types.put("boules", (short) 2216);
		sport_types.put("bowls", (short) 2217);
		sport_types.put("boxing", (short) 2218);
		sport_types.put("canadian_football", (short) 2219);
		sport_types.put("chess", (short) 2220);
		sport_types.put("cliff_diving", (short) 2221);
		sport_types.put("climbing", (short) 2222);
		sport_types.put("climbing_adventure", (short) 2223);
		sport_types.put("cockfighting", (short) 2224);
		sport_types.put("cricket", (short) 2225);
		sport_types.put("croquet", (short) 2226);
		sport_types.put("curling", (short) 2227);
		sport_types.put("cycling", (short) 2228);
		sport_types.put("darts", (short) 2229);
		sport_types.put("dog_racing", (short) 2230);
		sport_types.put("equestrian", (short) 2231);
		sport_types.put("fencing", (short) 2232);
		sport_types.put("field_hockey", (short) 2233);
		sport_types.put("free_flying", (short) 2234);
		sport_types.put("gaelic_games", (short) 2235);
		sport_types.put("golf", (short) 2236);
		sport_types.put("gymnastics", (short) 2237);
		sport_types.put("handball", (short) 2238);
		sport_types.put("hapkido", (short) 2239);
		sport_types.put("horseshoes", (short) 2240);
		sport_types.put("horse_racing", (short) 2241);
		sport_types.put("ice_hockey", (short) 2242);
		sport_types.put("ice_skating", (short) 2243);
		sport_types.put("ice_stock", (short) 2244);
		sport_types.put("judo", (short) 2245);
		sport_types.put("karting", (short) 2246);
		sport_types.put("kitesurfing", (short) 2247);
		sport_types.put("korfball", (short) 2248);
		sport_types.put("model_aerodrome", (short) 2249);
		sport_types.put("motocross", (short) 2250);
		sport_types.put("motor", (short) 2251);
		sport_types.put("multi", (short) 2252);
		sport_types.put("netball", (short) 2253);
		sport_types.put("obstacle_course", (short) 2254);
		sport_types.put("orienteering", (short) 2255);
		sport_types.put("paddle_tennis", (short) 2256);
		sport_types.put("parachuting", (short) 2257);
		sport_types.put("paragliding", (short) 2258);
		sport_types.put("pelota", (short) 2259);
		sport_types.put("racquet", (short) 2260);
		sport_types.put("rc_car", (short) 2261);
		sport_types.put("roller_skating", (short) 2262);
		sport_types.put("rowing", (short) 2263);
		sport_types.put("rugby_league", (short) 2264);
		sport_types.put("rugby_union", (short) 2265);
		sport_types.put("running", (short) 2266);
		sport_types.put("sailing", (short) 2267);
		sport_types.put("scuba_diving", (short) 2268);
		sport_types.put("shooting", (short) 2269);
		sport_types.put("skateboard", (short) 2270);
		sport_types.put("soccer", (short) 2271);
		sport_types.put("sumo", (short) 2272);
		sport_types.put("surfing", (short) 2273);
		sport_types.put("swimming", (short) 2274);
		sport_types.put("table_tennis", (short) 2275);
		sport_types.put("table_soccer", (short) 2276);
		sport_types.put("taekwondo", (short) 2277);
		sport_types.put("tennis", (short) 2278);
		sport_types.put("toboggan", (short) 2279);
		sport_types.put("volleyball", (short) 2280);
		sport_types.put("water_polo", (short) 2281);
		sport_types.put("water_ski", (short) 2282);
		sport_types.put("weightlifting", (short) 2283);
		sport_types.put("wrestling", (short) 2284);
		sport_types.put("yoga", (short) 2285);
		sport_types.put("canoe", (short) 2286);
		sport_types.put("cricket_nets", (short) 2287);
		sport_types.put("diving", (short) 2288);
		sport_types.put("football", (short) 2289);
		sport_types.put("hockey", (short) 2290);
		sport_types.put("safety_training", (short) 2291);
		sport_types.put("skating", (short) 2292);
		sport_types.put("skiing", (short) 2293);
		sport_types.put("fitness", (short) 2294);
		
		return (short) sport_types.get(v);
	}
	
	private short initTourismTypes(String v) {
		tourism_types = new HashMap<String, Short>();
		
		tourism_types.put("alpine_hut", (short) 1600);
		tourism_types.put("apartment", (short) 1601);
		tourism_types.put("aquarium", (short) 1602);
		tourism_types.put("artwork", (short) 1603);
		tourism_types.put("attraction", (short) 1604);
		tourism_types.put("camp_site", (short) 1605);
		tourism_types.put("caravan_site", (short) 1606);
		tourism_types.put("chalet", (short) 1607);
		tourism_types.put("gallery", (short) 1608);
		tourism_types.put("guest_house", (short) 1609);
		tourism_types.put("hostel", (short) 1610);
		tourism_types.put("hotel", (short) 1611);
		tourism_types.put("information", (short) 1612);
		tourism_types.put("motel", (short) 1613);
		tourism_types.put("museum", (short) 1614);
		tourism_types.put("picnic_site", (short) 1615);
		tourism_types.put("theme_park", (short) 1616);
		tourism_types.put("viewpoint", (short) 1617);
		tourism_types.put("wilderness_hut", (short) 1618);
		tourism_types.put("zoo", (short) 1619);
		tourism_types.put("yes", (short) 1620);
		tourism_types.put("tree_shrine", (short) 1621);
		
		return (short) tourism_types.get(v);
	}
	
	private short initHistoricTypes(String v) {
		historic_types = new HashMap<String, Short>();
		
		historic_types.put("aircraft", (short) 1700);
		historic_types.put("archaeological_site", (short) 1701);
		historic_types.put("battlefield", (short) 1702);
		historic_types.put("boundary_stone", (short) 1703);
		historic_types.put("building", (short) 1704);
		historic_types.put("cannon", (short) 1705);
		historic_types.put("castle", (short) 1706);
		historic_types.put("city_gate", (short) 1707);
		historic_types.put("citywalls", (short) 1708);
		historic_types.put("farm", (short) 1709);
		historic_types.put("fort", (short) 1710);
		historic_types.put("highwater_mark", (short) 1711);
		historic_types.put("locomotive", (short) 1712);
		historic_types.put("manor", (short) 1713);
		historic_types.put("memorial", (short) 1714);
		historic_types.put("milestone", (short) 1715);
		historic_types.put("monument", (short) 1716);
		historic_types.put("ruins", (short) 1717);
		historic_types.put("rune_stone", (short) 1718);
		historic_types.put("ship", (short) 1719);
		historic_types.put("wayside_cross", (short) 1720);
		historic_types.put("wayside_shrine", (short) 1721);
		historic_types.put("wreck", (short) 1722);
		historic_types.put("yes", (short) 1723);
		historic_types.put("gallows", (short) 1724);
		historic_types.put("building", (short) 1725);
		historic_types.put("monastery", (short) 1726);
		historic_types.put("optical_telegraph", (short) 1727);
		historic_types.put("pillory", (short) 1728);
		historic_types.put("tomb", (short) 1729);
		historic_types.put("house", (short) 1730);
		historic_types.put("arch", (short) 1731);
		historic_types.put("palace", (short) 1732);
		historic_types.put("fountain", (short) 1733);
		historic_types.put("castle_wall", (short) 1734);
		
		return (short) historic_types.get(v);
	}
	
	private short initEmergencyTypes(String v) {
		emergency_types = new HashMap<String, Short>();
		
		emergency_types.put("ambulance_station", (short) 1300);
		emergency_types.put("defibrillator", (short) 1301);
		emergency_types.put("fire_extinguisher", (short) 1302);
		emergency_types.put("fire_flapper", (short) 1303);
		emergency_types.put("fire_hose", (short) 1304);
		emergency_types.put("fire_hydrant", (short) 1305);
		emergency_types.put("water_tank", (short) 1306);
		emergency_types.put("lifeguard_base", (short) 1307);
		emergency_types.put("lifeguard_tower", (short) 1308);
		emergency_types.put("life_ring", (short) 1309);
		emergency_types.put("assembly_point", (short) 1310);
		emergency_types.put("access_point", (short) 1311);
		emergency_types.put("phone", (short) 1312);
		emergency_types.put("siren", (short) 1313);
		emergency_types.put("ses_station", (short) 1314);
		emergency_types.put("yes", (short) 1315);
		
		return (short) emergency_types.get(v);
	}
	
	private short initWaterwayTypes(String v) {
		waterway_types = new HashMap<String, Short>();
		
		waterway_types.put("river", (short) 400);
		waterway_types.put("stream", (short) 401);
		waterway_types.put("canal", (short) 402);
		waterway_types.put("drain", (short) 403);
		waterway_types.put("ditch", (short) 404);
		waterway_types.put("fairway", (short) 405);
		waterway_types.put("dock", (short) 406);
		waterway_types.put("dam", (short) 407);
		waterway_types.put("weir", (short) 408);
		waterway_types.put("waterfall", (short) 409);
		waterway_types.put("lock_gate", (short) 410);
		waterway_types.put("water_point_waterway", (short) 411);
		waterway_types.put("fuel_waterway", (short) 412);
		waterway_types.put("riverbank", (short) 413);
		waterway_types.put("wadi", (short) 414);
		waterway_types.put("drystream", (short) 415);
		waterway_types.put("yes", (short) 416);
		
		return (short) waterway_types.get(v);
	}
	
	private short initRailwayTypes(String v) {
		railway_types = new HashMap<String, Short>();
		
		railway_types.put("construction", (short) 500);
		railway_types.put("disused", (short) 501);
		railway_types.put("funicular", (short) 502);
		railway_types.put("light_rail", (short) 503);
		railway_types.put("miniature", (short) 504);
		railway_types.put("monorail", (short) 505);
		railway_types.put("narrow_gauge", (short) 506);
		railway_types.put("preserved", (short) 507);
		railway_types.put("rail", (short) 508);
		railway_types.put("subway", (short) 509);
		railway_types.put("tram", (short) 510);
		railway_types.put("crossing", (short) 511);
		railway_types.put("level_crossing", (short) 512);
		railway_types.put("halt", (short) 513);
		railway_types.put("platform", (short) 514);
		railway_types.put("station", (short) 515);
		railway_types.put("subway_entrance", (short) 516);
		railway_types.put("tram_stop", (short) 517);
		railway_types.put("abandoned", (short) 518);
		railway_types.put("buffer_stop", (short) 519);
		railway_types.put("derail", (short) 520);
		railway_types.put("signal", (short) 521);
		railway_types.put("switch", (short) 522);
		railway_types.put("railway_crossing", (short) 523);
		railway_types.put("turntable", (short) 534);
		railway_types.put("roundhouse", (short) 525);
		railway_types.put("traverser", (short) 526);
		railway_types.put("proposed", (short) 527);
		
		return (short) railway_types.get(v);		
	}
	
	private short initAerowayTypes(String v) {
		aeroway_types = new HashMap<String, Short>();
		
		aeroway_types.put("aerodrome", (short) 600);
		aeroway_types.put("apron", (short) 601);
		aeroway_types.put("gate", (short) 602);
		aeroway_types.put("hangar", (short) 603);
		aeroway_types.put("heliport", (short) 604);
		aeroway_types.put("navigationaid", (short) 605);
		aeroway_types.put("runway", (short) 606);
		aeroway_types.put("taxiway", (short) 607);
		aeroway_types.put("terminal", (short) 608);		
		aeroway_types.put("windsock", (short) 609);

		return (short) aeroway_types.get(v);
	}
	
	private short initAerialwayTypes(String v) {
		aerialway_types = new HashMap<String, Short>();
		
		aerialway_types.put("cable_car", (short) 700);
		aerialway_types.put("zip_line", (short) 701);
		aerialway_types.put("pylon", (short) 702);
		aerialway_types.put("station_aerialway", (short) 703);
		aerialway_types.put("goods", (short) 704);
		
		return (short) aerialway_types.get(v);
	}
	
	private short initPowerTypes(String v) {
		power_types = new HashMap<String, Short>();
		
		power_types.put("plant", (short) 800);
		power_types.put("cable", (short) 801);	
		power_types.put("compensator", (short) 802);
		power_types.put("converter", (short) 803);	
		power_types.put("generator", (short) 804);
		power_types.put("heliostat", (short) 805);
		power_types.put("insulator", (short) 806);
		power_types.put("line", (short) 807);
		power_types.put("minor_line", (short) 808);
		power_types.put("pole", (short) 809);
		power_types.put("portal", (short) 810);
		power_types.put("catenary_mast", (short) 811);
		power_types.put("substation", (short) 812);
		power_types.put("sub_station", (short) 812);
		power_types.put("switch", (short) 813);
		power_types.put("switchgear", (short) 813);
		power_types.put("terminal", (short) 814);
		power_types.put("tower", (short) 815);
		power_types.put("transformer", (short) 816);
		power_types.put("station", (short) 817);
		
		return (short) power_types.get(v);
	}
	
	private short initPlaceTypes(String v) {
		place_types = new HashMap<String, Short>();
		
		place_types.put("place", (short) 2500);
		
		return (short) place_types.get(v);
	}
	
	private short initLanduseTypes(String v) {
		landuse_types = new HashMap<String, Short>();
		
		landuse_types.put("allotments", (short) 1800);
		landuse_types.put("basin", (short) 1801);
		landuse_types.put("brownfield", (short) 1802);
		landuse_types.put("cemetery", (short) 1803);
		landuse_types.put("commercial", (short) 1804);
		landuse_types.put("construction", (short) 1805);		
		landuse_types.put("farmland", (short) 1806);
		landuse_types.put("farmyard", (short) 1807);
		landuse_types.put("forest", (short) 1808);
		landuse_types.put("garages", (short) 1809);
		landuse_types.put("grass", (short) 1810);
		landuse_types.put("greenfield", (short) 1811);
		landuse_types.put("greenhouse_horticulture", (short) 1812);
		landuse_types.put("industrial", (short) 1813);
		landuse_types.put("landfill", (short) 1814);
		landuse_types.put("meadow", (short) 1815);		
		landuse_types.put("military", (short) 1816);
		landuse_types.put("orchard", (short) 1817);
		landuse_types.put("plant_nursery", (short) 1818);
		landuse_types.put("port", (short) 1819);
		landuse_types.put("quarry", (short) 1820);
		landuse_types.put("railway", (short) 1821);
		landuse_types.put("recreation_ground", (short) 1822);
		landuse_types.put("reservoir", (short) 1823);
		landuse_types.put("residential", (short) 1824);
		landuse_types.put("retail", (short) 1825);		
		landuse_types.put("salt_pond", (short) 1826);
		landuse_types.put("village_green", (short) 1827);
		landuse_types.put("vineyard", (short) 1828);
		landuse_types.put("conservation", (short) 1829);
		landuse_types.put("pasture", (short) 1830);
		landuse_types.put("asphalt", (short) 1831);
		landuse_types.put("churchyard", (short) 1832);
		
		return (short) landuse_types.get(v);
	}
	
	private short initMilitaryTypes(String v) {
		military_types = new HashMap<String, Short>();
		
		military_types.put("airfield", (short) 1900);
		military_types.put("ammunition", (short) 1901);
		military_types.put("bunker", (short) 1902);
		military_types.put("barracks", (short) 1903);
		military_types.put("checkpoint", (short) 1904);
		military_types.put("danger_area", (short) 1905);
		military_types.put("naval_base", (short) 1906);
		military_types.put("nuclear_explosion_site", (short) 1907);
		military_types.put("obstacle_course", (short) 1908);
		military_types.put("office", (short) 1909);
		military_types.put("range", (short) 1910);
		military_types.put("training_area", (short) 1911);
		military_types.put("trench", (short) 1912);
		military_types.put("headquarters", (short) 1913);
		military_types.put("yes", (short) 1914);
		
		return (short) military_types.get(v);
	}
	
	private short initNaturalTypes(String v) {
		natural_types = new HashMap<String, Short>();
		
		natural_types.put("wood", (short) 2000);
		natural_types.put("tree_row", (short) 2001);
		natural_types.put("tree", (short) 2002);
		natural_types.put("scrub", (short) 2003);
		natural_types.put("heath", (short) 2004);
		natural_types.put("moor", (short) 2005);
		natural_types.put("grassland", (short) 2006);
		natural_types.put("fell", (short) 2007);
		natural_types.put("bare_rock", (short) 2008);
		natural_types.put("scree", (short) 2009);
		natural_types.put("shingle", (short) 2010);
		natural_types.put("sand", (short) 2011);
		natural_types.put("mud", (short) 2012);
		natural_types.put("water", (short) 2013);
		natural_types.put("wetland", (short) 2014);
		natural_types.put("glacier", (short) 2015);
		natural_types.put("bay", (short) 2016);
		natural_types.put("beach", (short) 2017);
		natural_types.put("coastline", (short) 2018);
		natural_types.put("spring", (short) 2019);
		natural_types.put("hot_spring", (short) 2020);
		natural_types.put("geyser", (short) 2021);
		natural_types.put("peak", (short) 2022);
		natural_types.put("volcano", (short) 2023);
		natural_types.put("valley", (short) 2024);
		natural_types.put("river_terrace", (short) 2025);
		natural_types.put("ridge", (short) 2026);
		natural_types.put("arete", (short) 2027);
		natural_types.put("cliff", (short) 2028);
		natural_types.put("saddle", (short) 2029);
		natural_types.put("rock", (short) 2030);
		natural_types.put("stone", (short) 2031);
		natural_types.put("sinkhole", (short) 2032);
		natural_types.put("cave_entrance", (short) 2033);
		natural_types.put("grass", (short) 2034);
		
		return (short) natural_types.get(v);
	}

	
	@Override
	public short getTypeOfObject(String k, String v) {	
		try {
			switch(k) {
			case "area:highway":
				return initHighwayTypes(v);
			case "highway":
				return initHighwayTypes(v);
			case "barrier":			
			    return initBarrierTypes(v);
		    case "building":		
			    return initBuildingTypes(v);
		    case "building:part":		
			    return initBuildingPartTypes(v);
		    case "waterway":			
			    return initWaterwayTypes(v);
		    case "railway":			
			    return initRailwayTypes(v);
		    case "aeroway":			
			    return initAerowayTypes(v);
		    case "aerialway":			
		    	return initAerialwayTypes(v);
		    case "power":			
		    	return initPowerTypes(v);
		    case "place":
		    	return initPlaceTypes(v);
		    case "emergency":
		    	return initEmergencyTypes(v);
		    case "landuse":
		    	return initLanduseTypes(v);
		    case "natural":
		    	return initNaturalTypes(v);
		    case "boundary":
		    	return initBoundaryTypes(v);
		    case "man_made":
		    	return initManMadeTypes(v);
		    case "leisure":
		    	return initLeisureTypes(v);
		    case "amenity":
		    	return initAmenityTypes(v);
		    case "office":
		    	return initOfficeTypes(v);
		    case "shop":
		    	return initShopTypes(v);
		    case "craft":
		    	return initCraftTypes(v);
		    case "tourism":
		    	return initTourismTypes(v);
		    case "historic":
		    	return initHistoricTypes(v);
		    case "military":
		    	return initMilitaryTypes(v);
		    case "sport":
		    	return initSportTypes(v);
		    case "surface":			
		    	return initSurfaceTypes(v);
		    case "tracktype":
		    	return initTracktypeTypes(v);
		    } 
		
		    return (short) 0;
		} catch(Exception ex) {
//			OsmConverter.printLog("TypesOfObject.java");
//			OsmConverter.printLog("TYPE: " + k + " = " + v);
//			OsmConverter.printLog("EXCEPTION: " + ex.toString() + "\n");
			
			return (short) 0;
		}
	}
	
	@Override
	public String getTypeOfObject(short v) {
		if(v >= highway_min && v <= highway_max) {
			if(v == 36) { // area:highway
				return "area:highway";
			} else
				return "highway";
		}
		else if(v >= barrier_min && v <= barrier_max)
			return "barrier";
		else if(v >= building_min && v <= building_max)
			return "building";
		else if(v >= building_part_min && v <= building_part_max)
			return "building_part";
		else if(v >= waterway_min && v <= waterway_max)
			return "waterway";
		else if(v >= railway_min && v <= railway_max)
			return "railway";
		else if(v >= aeroway_min && v <= aeroway_max)
			return "aeroway";
		else if(v >= aerialway_min && v <= aerialway_max)
			return "aerialway";
		else if(v >= emergency_min && v <= emergency_max)
			return "emergency";
		else if(v >= natural_min && v <= natural_max)
			return "natural";
		else if(v >= place_min && v <= place_max)
			return "place";
		else if(v >= landuse_min && v <= landuse_max)
			return "landuse";
		else if(v >= boundary_min && v <= boundary_max)
			return "boundary";
		else if(v >= power_min && v <= power_max)
			return "power";
		else if(v >= man_made_min && v <= man_made_max)
			return "man_made";
		else if(v >= leisure_min && v <= leisure_max)
			return "leisure";
		else if(v >= amenity_min && v <= amenity_max)
			return "amenity";
		else if(v >= office_min && v <= office_max)
			return "office";
		else if(v >= shop_min && v <= shop_max)
			return "shop";
		else if(v >= craft_min && v <= craft_max)
			return "craft";
		else if(v >= tourism_min && v <= tourism_max)
			return "tourism";
		else if(v >= historic_min && v <= historic_max)
			return "historic";
		else if(v >= military_min && v <= military_max)
			return "military";
		else if(v >= sport_min && v <= sport_max)
			return "sport";
		
		return "";
	}
/*	
	private String initNamesOfObjects(String v) {
		name_types = new HashMap<String, String>();
		
		name_types.put("cable_car", "Канатная дорога.");
		name_types.put("pylon", "Опора канатной дороги.");
		name_types.put("station_aerialway", "Станция канатной дороги для посадки и высадки пассажиров.");
		name_types.put("goods", "Грузовой подъёмник.");
		
		name_types.put("aerodrome", "Аэродром, аэропорт.");
		name_types.put("apron", "Перрон аэродрома.");
		name_types.put("gate", "Посадочный терминал.");
		name_types.put("hangar", "Ангар.");
		name_types.put("heliport", "Вертолётная посадочная площадка.");
		name_types.put("navigationaid", "Радио-навигационное оборудование (диспетчерская).");
		name_types.put("runway", "Взлётно-посадочная полоса.");
		name_types.put("taxiway", "Рулёжная дорожка.");
		name_types.put("terminal", "Терминал, здание аэропорта.");		
		name_types.put("windsock", "Указатель силы ветра.");
		
		name_types.put("bar", "Бар.");
		name_types.put("bbq", "Место отдыха, оборудованное мангалами.");
		name_types.put("biergarten", "Пивная на открытом воздухе.");
		name_types.put("cafe", "Кафе.");
		name_types.put("drinking_water", "Источник питьевой воды.");
		name_types.put("fast_food", "Заведение быстрого питания, фастфуд, забегаловка, пиццерия.");
		name_types.put("food_court", "Заведение быстрого питания в крупных торговых центрах, аэропортах и т.п.");
		name_types.put("ice_cream", "Магазин или кафе-мороженое.");
		name_types.put("pub", "Пивная.");
		name_types.put("restaurant", "Ресторан.");
		name_types.put("college", "Колледж, профессиональный лицей, училище.");
		name_types.put("kindergarten", "Детский сад.");
		name_types.put("library", "Библиотека.");
		name_types.put("public_bookcase", "Уличный общественный книжный шкаф.");
		name_types.put("school", "Школа, школьная площадка.");
		name_types.put("music_school", "Музыкальная школа.");
		name_types.put("driving_school", "Автошкола.");
		name_types.put("language_school", "Школа обучения иностранным языкам.");
		name_types.put("university", "Институт, университет, кампус.");
		name_types.put("bicycle_parking", "Парковка для велосипедов.");
		name_types.put("bicycle_repair_station", "Стойка для самостоятельного ремонта велосипеда.");
		name_types.put("bicycle_rental", "Аренда велосипедов.");
		name_types.put("boat_sharing", "Аренда лодок.");
		name_types.put("bus_station", "Автовокзал, автостанция.");
		name_types.put("car_rental", "Аренда автомобилей.");
		name_types.put("car_wash", "Автомойка.");
		name_types.put("charging_station", "Зарядка электромобилей.");
		name_types.put("ferry_terminal", "Паромный причал.");
		name_types.put("fuel", "АЗС, АГЗС и прочие.");
		name_types.put("grit_bin", "Ящик с аварийным запасом противогололёдных материалов.");
		name_types.put("motorcycle_parking", "Парковка для мотоциклов.");
		name_types.put("parking", "Стоянка.");
		name_types.put("parking_entrance", "Въезд на стоянку.");
		name_types.put("parking_space", "Парковочное место.");
		name_types.put("taxi", "Стоянка такси.");
		name_types.put("atm", "Банкомат.");
		name_types.put("bank", "Банк.");
		name_types.put("bureau_de_change", "Пункт обмена валют.");
		name_types.put("baby_hatch", "Детский дом, интернат.");
		name_types.put("clinic", "Крупная поликлиника.");
		name_types.put("dentist", "Стоматологическая клиника.");
		name_types.put("doctors", "Медицинский пункт.");
		name_types.put("hospital", "Больница, госпиталь.");
		name_types.put("nursing_home", "Дом для инвалидов или пожилых людей.");
		name_types.put("pharmacy", "Аптека.");
		name_types.put("social_facility", "Учреждение, оказывающее социальные услуги.");
		name_types.put("veterinary", "Ветеринарный пункт.");
		name_types.put("arts_centre", "Концертный зал, дом творчества, дом культуры, центр искусств.");
		name_types.put("brothel", "Публичный дом, бордель.");
		name_types.put("casino", "Казино, игровое заведение.");
		name_types.put("cinema", "Кинотеатр.");
		name_types.put("community_centre", "Место для проведения праздников и общественных мероприятий.");
		name_types.put("fountain", "Фонтан.");
		name_types.put("nightclub", "Ночной клуб, дискотека.");
		name_types.put("planetarium", "Планетарий");
		name_types.put("social_centre", "Место для свободной некоммерческой деятельности.");
		name_types.put("stripclub", (short) 2056);
		name_types.put("swingerclub", (short) 2057);
		name_types.put("theatre", (short) 2058);
		name_types.put("animal_boarding", (short) 2059);
		name_types.put("animal_shelter", (short) 2060);
		name_types.put("bench", (short) 2061);
		name_types.put("clock", (short) 2062);
		name_types.put("courthouse", (short) 2063);
		name_types.put("coworking_space", (short) 2064);
		name_types.put("crematorium", (short) 2065);
		name_types.put("crypt", (short) 2066);
		name_types.put("dive_centre", (short) 2067);
		name_types.put("dojo", (short) 2068);
		name_types.put("embassy", (short) 2069);
		name_types.put("fire_station", (short) 2070);
		name_types.put("grave_yard", (short) 2071);
		name_types.put("hunting_stand", (short) 2072);
		name_types.put("internet_cafe", (short) 2073);
		name_types.put("kneipp_water_cure", (short) 2074);
		name_types.put("marketplace", (short) 2075);
		name_types.put("photo_booth", (short) 2076);
		name_types.put("place_of_worship", (short) 2077);
		name_types.put("police", (short) 2078);
		name_types.put("post_box", (short) 2079);
		name_types.put("post_office", (short) 2080);
		name_types.put("prison", (short) 2081);
		name_types.put("ranger_station", (short) 2082);
		name_types.put("recycling", (short) 2083);
		name_types.put("rescue_station", (short) 2084);
		name_types.put("sauna", (short) 2085);
		name_types.put("shelter", (short) 2086);
		name_types.put("shower", (short) 2087);
		name_types.put("telephone", (short) 2088);
		name_types.put("toilets", (short) 2089);
		name_types.put("townhall", (short) 2090);
		name_types.put("vending_machine", (short) 2091);
		name_types.put("waste_basket", (short) 2092);
		name_types.put("waste_disposal", (short) 2093);
		name_types.put("watering_place", (short) 2094);
		name_types.put("water_point", (short) 2096);
		name_types.put("cable_barrier", (short) 200);
		name_types.put("city_wall", (short) 201);
		name_types.put("ditch_barrier", (short) 202);
		name_types.put("fence", (short) 203);
		name_types.put("guard_rail", (short) 204);
		name_types.put("handrail", (short) 205);
		name_types.put("hedge", (short) 206);
		name_types.put("kerb", (short) 207);
		name_types.put("retaining_wall", (short) 208);
		name_types.put("tank_trap", (short) 209);
		name_types.put("wall", (short) 210);
		name_types.put("block", (short) 211);
		name_types.put("bollard", (short) 212);
		name_types.put("border_control", (short) 213);
		name_types.put("bump_gate", (short) 214);
		name_types.put("bus_trap", (short) 215);
		name_types.put("cattle_grid", (short) 216);
		name_types.put("chain", (short) 217);
		name_types.put("cycle_barrier", (short) 218);
		name_types.put("debris", (short) 219);
		name_types.put("entrance_barrier", (short) 220);
		name_types.put("full-height_turnstile", (short) 221);
		name_types.put("gate", (short) 222);
		name_types.put("hampshire_gate", (short) 223);
		name_types.put("height_restrictor", (short) 224);
		name_types.put("horse_stile", (short) 225);
		name_types.put("jersey_barrier", (short) 226);
		name_types.put("kent_carriage_gap", (short) 227);
		name_types.put("kissing_gate", (short) 228);
		name_types.put("lift_gate", (short) 229);
		name_types.put("log", (short) 230);
		name_types.put("motocycle_barrier", (short) 231);
		name_types.put("rope", (short) 232);
		name_types.put("sally_port", (short) 233);
		name_types.put("spikes", (short) 234);
		name_types.put("stile", (short) 235);
		name_types.put("sump_buster", (short) 236);
		name_types.put("swing_gate", (short) 237);
		name_types.put("toll_booth", (short) 238);
		name_types.put("turnstile", (short) 239);
		name_types.put("yes_barrier", (short) 240);
		name_types.put("administrative", (short) 11000);
		name_types.put("boundary", (short) 11001);
		name_types.put("yes", (short) 300);
		name_types.put("entrance", (short) 301);
		name_types.put("craft", (short) 6400);
		name_types.put("ambulance_station", (short) 5000);
		name_types.put("defibrillator", (short) 5001);
		name_types.put("fire_extinguisher", (short) 5002);
		name_types.put("fire_flapper", (short) 5003);
		name_types.put("fire_hose", (short) 5004);
		name_types.put("fire_hydrant", (short) 5005);
		name_types.put("water_tank", (short) 5006);
		name_types.put("lifeguard_base", (short) 5007);
		name_types.put("lifeguard_tower", (short) 5008);
		name_types.put("life_ring", (short) 5009);
		name_types.put("assembly_point", (short) 5010);
		name_types.put("access_point", (short) 5011);
		name_types.put("phone", (short) 5012);
		name_types.put("siren", (short) 5013);
		name_types.put("blood_donation", (short) 2095);
		name_types.put("motorway", (short) 1);		
		name_types.put("primary", (short) 2);		
		name_types.put("secondary", (short) 3);		
		name_types.put("tertiary", (short) 4);		
		name_types.put("unclassified", (short) 5);		
		name_types.put("residential", (short) 6);		
		name_types.put("track", (short) 7); 
		name_types.put("bridleway", (short) 8);
		name_types.put("raceway", (short) 9);
		name_types.put("road", (short) 10); 
		name_types.put("footway", (short) 11);
		name_types.put("steps", (short) 12);
		name_types.put("path", (short) 13);
		name_types.put("cycleway", (short) 14);
		name_types.put("proposed", (short) 15);
		name_types.put("construction_highway", (short) 16);
		name_types.put("bus_stop", (short) 17);
		name_types.put("crossing", (short) 18); 
		name_types.put("elevator", (short) 19);
		name_types.put("give_way", (short) 20);
		name_types.put("mini_roundabout", (short) 21);
		name_types.put("passing_place", (short) 22);
		name_types.put("rest_area", (short) 23);
		name_types.put("speed_camera", (short) 24);
		name_types.put("street_lamp", (short) 25);
		name_types.put("services", (short) 26);
		name_types.put("traffic_signals", (short) 27);
		name_types.put("turning_circle", (short) 28);
		name_types.put("ford", (short) 29);
		name_types.put("winter_road", (short) 30);
		name_types.put("stop", (short) 31);
		name_types.put("emergency_access_point", (short) 32);
		name_types.put("escape", (short) 33);
		name_types.put("paved", (short) 10001);
		name_types.put("asphalt", (short) 10002);
		name_types.put("sett", (short) 10003);
		name_types.put("concrete", (short) 10004);
		name_types.put("paving_stones", (short) 10005);
		name_types.put("cobblestone", (short) 10006);
		name_types.put("metal", (short) 10007);
		name_types.put("wood", (short) 10008);
		name_types.put("unpaved", (short) 10009);
		name_types.put("compacted", (short) 10010);
		name_types.put("salt", (short) 10011);
		name_types.put("woodchips", (short) 10012);
		name_types.put("tartan", (short) 10013);
		name_types.put("clay", (short) 10014);
		name_types.put("metal_grid", (short) 10015);				
		name_types.put("grade1", (short) 10231);
		name_types.put("grade2", (short) 10232);
		name_types.put("grade3", (short) 10233);
		name_types.put("grade4", (short) 10234);
		name_types.put("grade5", (short) 10235);		
		name_types.put("aircraft", (short) 6800);
		name_types.put("archaeological_site", (short) 6801);
		name_types.put("battlefield", (short) 6802);
		name_types.put("boundary_stone", (short) 6803);
		name_types.put("building", (short) 6804);
		name_types.put("cannon", (short) 6805);
		name_types.put("castle", (short) 6806);
		name_types.put("city_gate", (short) 6807);
		name_types.put("citywalls", (short) 6808);
		name_types.put("farm", (short) 6809);
		name_types.put("fort", (short) 6810);
		name_types.put("highwater_mark", (short) 6811);
		name_types.put("locomotive", (short) 6812);
		name_types.put("manor", (short) 6813);
		name_types.put("memorial", (short) 6814);
		name_types.put("milestone", (short) 6815);
		name_types.put("monument", (short) 6816);
		name_types.put("ruins", (short) 6817);
		name_types.put("rune_stone", (short) 6818);
		name_types.put("ship", (short) 6819);
		name_types.put("wayside_cross", (short) 6820);
		name_types.put("wayside_shrine", (short) 6821);
		name_types.put("wreck", (short) 6822);
		name_types.put("yes_historic", (short) 6823);
		name_types.put("allotments", (short) 7000);
		name_types.put("basin", (short) 7001);
		name_types.put("brownfield", (short) 7002);
		name_types.put("cemetery", (short) 7003);
		name_types.put("commercial", (short) 7004);
		name_types.put("construction", (short) 7005);		
		name_types.put("farmland", (short) 7006);
		name_types.put("farmyard", (short) 7007);
		name_types.put("forest", (short) 7008);
		name_types.put("garages", (short) 7009);
		name_types.put("grass", (short) 7010);
		name_types.put("greenfield", (short) 7011);
		name_types.put("greenhouse_horticulture", (short) 7012);
		name_types.put("industrial", (short) 7013);
		name_types.put("landfill", (short) 7014);
		name_types.put("meadow", (short) 7015);		
		name_types.put("military", (short) 7016);
		name_types.put("orchard", (short) 7017);
		name_types.put("plant_nursery", (short) 7018);
		name_types.put("port", (short) 7019);
		name_types.put("quarry", (short) 7020);
		name_types.put("railway", (short) 7021);
		name_types.put("recreation_ground", (short) 7022);
		name_types.put("reservoir", (short) 7023);
		name_types.put("residential_landuse", (short) 7024);
		name_types.put("retail", (short) 7025);		
		name_types.put("salt_pond", (short) 7026);
		name_types.put("village_green", (short) 7027);
		name_types.put("vineyard", (short) 7028);
		name_types.put("adult_gaming_centre", (short) 1000);
		name_types.put("beach_resort", (short) 1001);
		name_types.put("bandstand", (short) 1002);
		name_types.put("bird_hide", (short) 1003);
		name_types.put("common", (short) 1004);
		name_types.put("dance", (short) 1005);
		name_types.put("dog_park", (short) 1006);
		name_types.put("firepit", (short) 1007);
		name_types.put("fishing", (short) 1008);
		name_types.put("fitness_centre", (short) 1009);
		name_types.put("garden", (short) 1010);
		name_types.put("golf_course", (short) 1011);
		name_types.put("hackerspace", (short) 1012);
		name_types.put("horse_riding", (short) 1013);
		name_types.put("ice_rink", (short) 1014);
		name_types.put("marina", (short) 1015);
		name_types.put("miniature_golf", (short) 1016);
		name_types.put("nature_reserve", (short) 1017);
		name_types.put("park", (short) 1018);
		name_types.put("picnic_table", (short) 1019);
		name_types.put("pitch", (short) 1020);
		name_types.put("playground", (short) 1021);
		name_types.put("slipway", (short) 1022);
		name_types.put("sports_centre", (short) 1023);
		name_types.put("stadium", (short) 1024);
		name_types.put("summer_camp", (short) 1025);
		name_types.put("swimming_area", (short) 1026);
		name_types.put("swimming_pool", (short) 1027);
		name_types.put("track_leisure", (short) 1028);
		name_types.put("water_park", (short) 1029);
		name_types.put("wildlife_hide", (short) 1030);
		name_types.put("adit", (short) 900);
		name_types.put("beacon", (short) 901);
		name_types.put("breakwater", (short) 902);
		name_types.put("bridge", (short) 903);
		name_types.put("bunker_silo", (short) 904);
		name_types.put("campanile", (short) 905);
		name_types.put("chimney", (short) 906);
		name_types.put("communications_tower", (short) 907);
		name_types.put("crane", (short) 908);
		name_types.put("cutline", (short) 909);
		name_types.put("clearcut", (short) 910);
		name_types.put("embankment", (short) 911);
		name_types.put("dyke", (short) 912);
		name_types.put("flagpole", (short) 913);
		name_types.put("gasometer", (short) 914);
		name_types.put("groyne", (short) 915);
		name_types.put("hot_water_tank", (short) 916);
		name_types.put("lighthouse", (short) 917);
		name_types.put("mast", (short) 918);
		name_types.put("mineshaft", (short) 919);
		name_types.put("monitoring_station", (short) 920);
		name_types.put("obelisk", (short) 921);
		name_types.put("observatory", (short) 922);
		name_types.put("petroleum_well", (short) 923);
		name_types.put("pier", (short) 924);
		name_types.put("pipeline", (short) 925);
		name_types.put("reservoir_covered", (short) 926);
		name_types.put("storage_tank", (short) 927);
		name_types.put("surveillance", (short) 928);
		name_types.put("survey_point", (short) 929);
		name_types.put("telescope", (short) 930);
		name_types.put("tower", (short) 931);
		name_types.put("wastewater_plant", (short) 932);
		name_types.put("watermill", (short) 933);
		name_types.put("water_tower", (short) 934);
		name_types.put("water_well", (short) 935);
		name_types.put("water_tap", (short) 936);
		name_types.put("water_works", (short) 937);
		name_types.put("windmill", (short) 938);
		name_types.put("works", (short) 939);
		name_types.put("yes_nam_made", (short) 940);
		name_types.put("airfield", (short) 8000);
		name_types.put("ammunition", (short) 8001);
		name_types.put("bunker", (short) 8002);
		name_types.put("barracks", (short) 8003);
		name_types.put("checkpoint", (short) 8004);
		name_types.put("danger_area", (short) 8005);
		name_types.put("naval_base", (short) 8006);
		name_types.put("nuclear_explosion_site", (short) 8007);
		name_types.put("obstacle_course", (short) 8008);
		name_types.put("office_military", (short) 8009);
		name_types.put("range", (short) 8010);
		name_types.put("training_area", (short) 8011);
		name_types.put("trench", (short) 8012);
		name_types.put("wood", (short) 9000);
		name_types.put("tree_row", (short) 9002);
		name_types.put("tree", (short) 9003);
		name_types.put("scrub", (short) 9003);
		name_types.put("heath", (short) 9004);
		name_types.put("moor", (short) 9005);
		name_types.put("grassland", (short) 9006);
		name_types.put("fell", (short) 9007);
		name_types.put("bare_rock", (short) 9008);
		name_types.put("scree", (short) 9009);
		name_types.put("shingle", (short) 9010);
		name_types.put("sand", (short) 9011);
		name_types.put("mud", (short) 9012);
		name_types.put("water", (short) 9013);
		name_types.put("wetland", (short) 9014);
		name_types.put("glacier", (short) 9015);
		name_types.put("bay", (short) 9016);
		name_types.put("beach", (short) 9017);
		name_types.put("coastline", (short) 9018);
		name_types.put("spring", (short) 9019);
		name_types.put("hot_spring", (short) 9020);
		name_types.put("geyser", (short) 9021);
		name_types.put("peak", (short) 9022);
		name_types.put("volcano", (short) 9023);
		name_types.put("valley", (short) 9024);
		name_types.put("river_terrace", (short) 9025);
		name_types.put("ridge", (short) 9026);
		name_types.put("arete", (short) 9027);
		name_types.put("cliff", (short) 9028);
		name_types.put("saddle", (short) 9029);
		name_types.put("rock", (short) 9030);
		name_types.put("stone", (short) 9031);
		name_types.put("sinkhole", (short) 9032);
		name_types.put("cave_entrance", (short) 9033);
		name_types.put("office", (short) 6000);
		name_types.put("plant", (short) 800);
		name_types.put("cable", (short) 801);	
		name_types.put("compensator", (short) 802);
		name_types.put("converter", (short) 803);	
		name_types.put("generator", (short) 804);
		name_types.put("heliostat", (short) 805);
		name_types.put("insulator", (short) 806);
		name_types.put("line", (short) 807);
		name_types.put("minor_line", (short) 808);
		name_types.put("pole", (short) 809);
		name_types.put("portal", (short) 810);
		name_types.put("catenary_mast", (short) 811);
		name_types.put("substation", (short) 812);
		name_types.put("switch_power", (short) 813);
		name_types.put("terminal_power", (short) 814);
		name_types.put("tower_power", (short) 815);
		name_types.put("transformer", (short) 816);
		name_types.put("construction_railway", (short) 500);
		name_types.put("disused", (short) 501);
		name_types.put("funicular", (short) 502);
		name_types.put("light_rail", (short) 503);
		name_types.put("miniature", (short) 504);
		name_types.put("monorail", (short) 505);
		name_types.put("narrow_gauge", (short) 506);
		name_types.put("preserved", (short) 507);
		name_types.put("rail", (short) 508);
		name_types.put("subway", (short) 509);
		name_types.put("tram", (short) 510);
		name_types.put("crossing_railway", (short) 511);
		name_types.put("level_crossing", (short) 512);
		name_types.put("halt", (short) 513);
		name_types.put("platform", (short) 514);
		name_types.put("station", (short) 515);
		name_types.put("subway_entrance", (short) 516);
		name_types.put("tram_stop", (short) 517);
		name_types.put("abandoned", (short) 518);
		name_types.put("buffer_stop", (short) 519);
		name_types.put("derail", (short) 520);
		name_types.put("signal", (short) 521);
		name_types.put("switch", (short) 522);
		name_types.put("railway_crossing", (short) 523);
		name_types.put("turntable", (short) 534);
		name_types.put("roundhouse", (short) 525);
		name_types.put("traverser", (short) 526);
		name_types.put("shop", (short) 6200);
		name_types.put("9pin", (short) 12000);
		name_types.put("10pin", (short) 12001);
		name_types.put("american_football", (short) 12002);
		name_types.put("aikido", (short) 12003);
		name_types.put("archery", (short) 12004);
		name_types.put("athletics", (short) 12005);
		name_types.put("australian_football", (short) 12006);
		name_types.put("badminton", (short) 12007);
		name_types.put("bandy", (short) 12008);
		name_types.put("base", (short) 12009);
		name_types.put("baseball", (short) 12010);
		name_types.put("basketball", (short) 12011);
		name_types.put("beachvolleyball", (short) 12012);
		name_types.put("billiards", (short) 12013);
		name_types.put("bmx", (short) 12014);
		name_types.put("bobsleigh", (short) 12015);
		name_types.put("boules", (short) 12016);
		name_types.put("bowls", (short) 12017);
		name_types.put("boxing", (short) 12018);
		name_types.put("canadian_football", (short) 12019);
		name_types.put("chess", (short) 12020);
		name_types.put("cliff_diving", (short) 12021);
		name_types.put("climbing", (short) 12022);
		name_types.put("climbing_adventure", (short) 12023);
		name_types.put("cockfighting", (short) 12024);
		name_types.put("cricket", (short) 12025);
		name_types.put("croquet", (short) 12026);
		name_types.put("curling", (short) 12027);
		name_types.put("cycling", (short) 12028);
		name_types.put("darts", (short) 12029);
		name_types.put("dog_racing", (short) 12030);
		name_types.put("equestrian", (short) 12031);
		name_types.put("fencing", (short) 12032);
		name_types.put("field_hockey", (short) 12033);
		name_types.put("free_flying", (short) 12034);
		name_types.put("gaelic_games", (short) 12035);
		name_types.put("golf", (short) 12036);
		name_types.put("gymnastics", (short) 12037);
		name_types.put("handball", (short) 12038);
		name_types.put("hapkido", (short) 12039);
		name_types.put("horseshoes", (short) 12040);
		name_types.put("horse_racing", (short) 12041);
		name_types.put("ice_hockey", (short) 12042);
		name_types.put("ice_skating", (short) 12043);
		name_types.put("ice_stock", (short) 12044);
		name_types.put("judo", (short) 12045);
		name_types.put("karting", (short) 12046);
		name_types.put("kitesurfing", (short) 12047);
		name_types.put("korfball", (short) 12048);
		name_types.put("model_aerodrome", (short) 12049);
		name_types.put("motocross", (short) 12050);
		name_types.put("motor", (short) 12051);
		name_types.put("multi", (short) 12052);
		name_types.put("netball", (short) 12053);
		name_types.put("obstacle_course_sport", (short) 12054);
		name_types.put("orienteering", (short) 12055);
		name_types.put("paddle_tennis", (short) 12056);
		name_types.put("parachuting", (short) 12057);
		name_types.put("paragliding", (short) 12058);
		name_types.put("pelota", (short) 12059);
		name_types.put("racquet", (short) 12060);
		name_types.put("rc_car", (short) 12061);
		name_types.put("roller_skating", (short) 12062);
		name_types.put("rowing", (short) 12063);
		name_types.put("rugby_league", (short) 12064);
		name_types.put("rugby_union", (short) 12065);
		name_types.put("running", (short) 12066);
		name_types.put("sailing", (short) 12067);
		name_types.put("scuba_diving", (short) 12068);
		name_types.put("shooting", (short) 12069);
		name_types.put("skateboard", (short) 12070);
		name_types.put("soccer", (short) 12071);
		name_types.put("sumo", (short) 12072);
		name_types.put("surfing", (short) 12073);
		name_types.put("swimming", (short) 12074);
		name_types.put("table_tennis", (short) 12075);
		name_types.put("table_soccer", (short) 12076);
		name_types.put("taekwondo", (short) 12077);
		name_types.put("tennis", (short) 12078);
		name_types.put("toboggan", (short) 12079);
		name_types.put("volleyball", (short) 12080);
		name_types.put("water_polo", (short) 12081);
		name_types.put("water_ski", (short) 12082);
		name_types.put("weightlifting", (short) 12083);
		name_types.put("wrestling", (short) 12084);
		name_types.put("yoga", (short) 12085);
		name_types.put("alpine_hut", (short) 6600);
		name_types.put("apartment", (short) 6601);
		name_types.put("aquarium", (short) 6602);
		name_types.put("artwork", (short) 6603);
		name_types.put("attraction", (short) 6604);
		name_types.put("camp_site", (short) 6605);
		name_types.put("caravan_site", (short) 6606);
		name_types.put("chalet", (short) 6607);
		name_types.put("gallery", (short) 6608);
		name_types.put("guest_house", (short) 6609);
		name_types.put("hostel", (short) 6610);
		name_types.put("hotel", (short) 6611);
		name_types.put("information", (short) 6612);
		name_types.put("motel", (short) 6613);
		name_types.put("museum", (short) 6614);
		name_types.put("picnic_site", (short) 6615);
		name_types.put("theme_park", (short) 6616);
		name_types.put("viewpoint", (short) 6617);
		name_types.put("wilderness_hut", (short) 6618);
		name_types.put("zoo", (short) 6619);
		name_types.put("yes_tourism", (short) 6620);
		name_types.put("river", (short) 400);
		name_types.put("stream", (short) 401);
		name_types.put("canal", (short) 402);
		name_types.put("drain", (short) 403);
		name_types.put("ditch", (short) 404);
		name_types.put("fairway", (short) 405);
		name_types.put("dock", (short) 406);
		name_types.put("dam", (short) 407);
		name_types.put("weir", (short) 408);
		name_types.put("waterfall", (short) 409);
		name_types.put("lock_gate", (short) 410);
		name_types.put("water_point_waterway", (short) 411);
		name_types.put("fuel_waterway", (short) 412);
		
		return "";
	}
	
	public String getNameOfObject(String v) {
		initNamesOfObjects(v);
		return "";
	}*/
}
